[
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Barcode Scanner App & Website Creation",
        "description": "We are looking to develop a barcode scanner app and an integrated website, inspired by the YUKA App and yuka.io. The primary function of the barcode scanner will be product lookup and color/score ratings based on ingredients and manufacturer's location.\n\nKey Features of the App:\n\n- Premium Features: There will be a donation-based model to unlock premium features where users will also be prompted to sign in for an account. This includes access to scan history, favorites, recommendations, product search, etc.\n- User Accounts: Users should be able to create their own accounts on App and manage the same integrated data on the website with same login credentials.\n- Product Search: Premium users should be able to search for products by name or category on both App and website.\n- Color Ratin...",
        "skills": [
            "Android",
            "iOS Development",
            "Mobile App Development",
            "MySQL",
            "PHP"
        ],
        "budget": "$14272\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "qEEG Recording Software Development",
        "description": "I am looking for a developer to create a local desktop application (Windows 10/11) for qEEG data acquisition with the Neurosity Crown EEG headset.\n✅ Goal:\nConnection via Bluetooth (BLE) to the Crown\nLive streaming & visualization of EEG data (time series, FFT/PSD)\nAssignment of channels according to the 10–20 system and checking of electrode contact\nLocal storage incl. export to EDF+ (alternatively CSV/JSON)\nSimple GUI for control & session management\n\n? Technical setup:\nPlatform: Windows 10/11\nLanguage: open (Python, C++, JS/Electron, etc.)\nOffline solution (no cloud)\nImportant: Support for EDF+ export format\n\n? Requirements:\nExperience with BLE, ideally with EEG devices\nKnowledge of EEG signal processing\nExperience with EDF+ desirable\nWillingness to work with limited device...",
        "skills": [
            "Arduino",
            "C Programming",
            "C++ Programming",
            "Python",
            "Software Architecture"
        ],
        "budget": "$528\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Natural Style Social Media Photo Editing",
        "description": "I'm seeking a skilled photo editor to enhance my photos for social media. Your edits should reflect a natural look - clean and unobtrusive. \n\nKey Tasks:\n- Color correction: Ensuring the colors in the photo are balanced and appealing.\n- Blemish removal: Minor imperfections should be addressed without altering the integrity of the image.\n- Cropping/Resizing: Photos must be cropped and resized appropriately for optimal use across various social media platforms.\n\nIdeal Candidates Should Have:\n- Extensive experience with photo editing software.\n- A keen eye for detail and a deep understanding of the natural look.\n- Prior work with social media content.\n\nPlease provide a portfolio of your previous work that aligns with this project.",
        "skills": [
            "Photo Editing",
            "Photoshop",
            "Photoshop Design",
            "Social Media Marketing"
        ],
        "budget": "$290\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "App Submission Expert Needed for iOS & Android",
        "description": "I am seeking a seasoned professional to assist with the submission of my app to both the Apple App Store and Google Play Store. All necessary materials, including screenshots, icons, feature graphics, privacy policies, and descriptions, will be provided. \n\nThe ideal candidate should:\n- Have proven experience in app submission to both platforms\n- Be familiar with the submission process and requirements of both stores\n- Able to ensure optimal presentation of the app in the stores\n\nMy app has already been tested for compliance with both stores' guidelines and I have developer accounts set up for both. Your role will simply be to facilitate the submission process. \n\nPlease submit your bid with a brief overview of your relevant experience. I look forward to working with you.",
        "skills": [
            "Android",
            "iPad",
            "iPhone",
            "Mobile App Development",
            "Mobile App Testing"
        ],
        "budget": "$457\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Elegant Logo & Beauty Packaging Design",
        "description": "I'm in need of a talented designer to create a classic and elegant logo and packaging for a beauty and cosmetics product. \nKey Requirements:\n- Design a sophisticated and timeless logo that reflects the elegance of the brand.\n- Create designs for both primary packaging (like jars or bottles) and secondary packaging (like outer boxes). \nIdeal Skills:\n- Extensive experience in logo and packaging design, particularly in the beauty and cosmetics industry.\n- A strong portfolio showcasing modern, clean, classic and elegant design aesthetics.\n- Ability to understand and translate brand values into design elements.",
        "skills": [
            "Corporate Identity",
            "Covers & Packaging",
            "Graphic Design",
            "Logo Design",
            "Photoshop"
        ],
        "budget": "$63\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Social Media Engagement Report Designer",
        "description": "I am seeking a professional who can design a comprehensive social media report template focusing on engagement metrics from Facebook and Instagram. We currently use AgoraPulse. The calculations are not always accurate. I need a solution to track metrics for FB & IG month to month that calculations populate as i make edits. The report should be presented as a well-structured PDF document. \n\nIdeal skills for this project include:\n- Proficiency in data analysis\n- Experience with social media metrics\n- Graphic design skills for creating visually appealing PDF reports \n\nPlease include samples of previous similar work in your proposal.",
        "skills": [
            "Brochure Design",
            "Excel",
            "Graphic Design",
            "Photoshop",
            "Powerpoint"
        ],
        "budget": "$333\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Shopify Store Revamp",
        "description": "I'm seeking a proficient Shopify developer to revamp my site, elladean.com. The goal is to modernize its appearance, enhance user navigation and product display, and implement a high-converting layout and structure inspired by this Shopify theme:",
        "skills": [
            "eCommerce",
            "Shopify",
            "Shopify Development",
            "Shopify Templates",
            "Shopping Cart Integration"
        ],
        "budget": "$427\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Physics Exam class 11 and class 12",
        "description": "I'm seeking a physics specialist to help me tackle problems from my class 11 and 12 curriculum. The focus will be on preparing for upcoming exams, so experience with this level of physics is essential.",
        "skills": [
            "Physics",
            "Physics Tutoring"
        ],
        "budget": "$54\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Comprehensive HR Support for Hiring & Onboarding",
        "description": "I'm seeking an experienced HR professional to assist with our hiring and onboarding processes. Your main responsibilities will include resume screening, interview scheduling, and managing various other HR operations. The roles we are looking to fill range from junior to mid-level positions. \n\nKey Responsibilities:\n- Resume screening and interview scheduling for both junior and mid-level positions\n- Overseeing onboarding processes including orientation sessions, paperwork and documentation, as well as training and development planning\n\nIdeal Skills:\n- Strong background in Human Resources Management\n- Proven experience in hiring and onboarding processes\n- Excellent communication and organizational skills\n- Previous background in manufacturing industry preferred\n\nYour role will be crucia...",
        "skills": [
            "Business Writing",
            "Report Writing",
            "Research Writing",
            "Resumes",
            "Technical Writing"
        ],
        "budget": "$290\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Portrait Face & Hair Color Swap",
        "description": "I need an expert in photo editing and color correction to help me swap my face into a portrait of someone else, as well as changing my hair color to match seamlessly. \n\nKey Requirements:\n- Face Swap: You will need to replace the existing face in the portrait with mine.\n- Hair Color Change: My hair color will also need to be changed to fit the photo. This should be done in a natural and subtle way, rather than a dramatic or noticeable change.\n\nIdeal Skills:\n- Proficiency in advanced photo editing software (like Photoshop)\n- Prior experience with similar face and hair color swaps\n- Excellent understanding of color matching and blending\n- Strong attention to detail for a realistic final product",
        "skills": [
            "Graphic Design",
            "Photo Editing",
            "Photography",
            "Photoshop",
            "Photoshop Design"
        ],
        "budget": "$26\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Flutter & Kotlin Expert: WebRTC & OpenAI Integration",
        "description": "I'm seeking a seasoned mobile developer with extensive experience in Flutter and Kotlin. The task is to integrate existing code for a WebRTC-based 1:1 video call and OpenAI Whisper-based voice processing. \n\nKey Details:\n- The integration primarily involves post-call voice analysis with OpenAI Whisper.\n- The WebRTC SDK will be used for both video and voice calling, although the current focus is predominantly on 1:1 video calls.\n\nImportant:\n- Only serious experts should apply, as this could lead to a long-term collaboration.\n- A prior experience with the WebRTC SDK is mandatory. Your skills will be evaluated through a test to ensure you are a genuine long-term developer.\n- Please note that applications from individuals without this specific experience will be reported as spam.",
        "skills": [
            "Android",
            "iPhone",
            "JavaScript",
            "Mobile App Development",
            "PHP"
        ],
        "budget": "$238\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Script Writer for Real Estate & Tech YouTube Channel",
        "description": "I'm on the lookout for a talented scriptwriter who can craft engaging scripts and YouTube/video descriptions for my channel with keyword insertion to them for the SEO. This is a consistent, ongoing project where keywords will be embedded to multiple scripts will be needed weekly.\n\nKey Responsibilities:\n- Embed given keywords naturally and effectively (Adding minimum 40 keywords)\n- Adhere to provided tone and format\n\nMy favourite animal is Panda.\n\nIdeal Skills:\n- Strong writing skills\n- Ability to understand and write for different formats and tones\n- Experience or interest in real estate and tech\n- SEO knowledge (for keyword embedding)\n\nIf you are replying to this job post, let me know what my favourite animal is at the end.\n\nThe perfect candidate should be able to deliver high-qualit...",
        "skills": [
            "Catch Phrases",
            "Content Writing",
            "Copywriting",
            "Keyword Research"
        ],
        "budget": "$11 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Sleek Modern Packaging Design",
        "description": "I'm seeking a professional packaging designer to create a modern and sleek design for boxes packaging. I have 14 different designs, each with a unique name and logo, but they all share the same size.\n\nKey requirements:\n- The packaging must include the product name and logo, usage instructions, and nutritional information.\n- Ideal candidates should have a strong portfolio of modern and sleek packaging designs.\n- Experience with designing for blister packs is a plus.\n\nPlease show your work\n\nref attached (the ref photo is not my brand but I want to make similar)",
        "skills": [
            "Corporate Identity",
            "Covers & Packaging",
            "Graphic Design",
            "Logo Design",
            "Packaging Design"
        ],
        "budget": "$190\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Tamil Voice Over for Promotional Video",
        "description": "I'm looking for a talented voice artist who can convert English text voice into Tamil voice for a less than 5 minute promotional video. \n\nKey Requirements:\n- The Tamil voice should be similar to the original English voice but with necessary cultural adjustments. \n- The voice over should match the tone and style of the English voice but be adapted for a Tamil audience.\n- Previous experience with voice overs for promotional videos is preferred.\n\nSkills and Experience:\n- Proficiency in English and Tamil.\n- Experience in voice acting and audio production.\n- Ability to understand and implement cultural adjustments in tone and style.\n\nPlease provide samples of your previous work.",
        "skills": [
            "Audio Production",
            "Audio Services",
            "Commercials",
            "Hindi Translator",
            "Voice Talent"
        ],
        "budget": "$7 - $17"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Startup Medical Company Admin Support",
        "description": "I'm seeking a multitasking professional to assist with various administrative tasks for a startup medical company. Your primary responsibilities will include taking requests for information, finding financial sponsors, and general personal assistant tasks.\n\nKey Responsibilities:\n- Taking requests for information related to capital equipment and soft costs.\n- Seeking financial sponsors to facilitate a lease.\n- Assisting with personal guarantor search for deposit.\n- Performing general personal assistant tasks.\n- Finding and coodinating other freelancers for video, photo optimization, organization, and not trying to do it all on thier own via scope creep.\n\nYour English proficiency is crucial, particularly when finding financial sponsors. You will also be responsible for scheduling meetin...",
        "skills": [
            "Organization Design",
            "Telemarketing"
        ],
        "budget": "$18\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Running Shoe Design",
        "description": "I have a shoe model just looking to add some design on to it",
        "skills": [
            "3D Modelling",
            "3D Rendering",
            "Graphic Design",
            "Solidworks",
            "Website Design"
        ],
        "budget": "$72\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Wikipedia Page Creation for Company",
        "description": "I need a Wikipedia page for my client company. The page should focus primarily on the company's history, including the founding date and background of the founders, as well as major achievements throughout the company's journey. \n\nKey Responsibilities:\n- Craft a comprehensive and compelling company history\n- Identify and incorporate key milestones and major achievements\n- Ensure all information is sourced from reliable references\n\nIdeal Skills and Experience:\n- Proven experience in creating Wikipedia pages\n- Excellent research skills to find and verify information\n- Strong writing skills to present the information in an engaging way\n\nPlease note, I currently do not have reliable sources for this information and will need your expertise in finding appropriate references.",
        "skills": [
            "Article Writing",
            "Copywriting",
            "Ghostwriting",
            "Research",
            "Research Writing"
        ],
        "budget": "$137\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "AI-Generated Comedy YouTube Shorts for Kids",
        "description": "I'm looking for a talented freelancer who can create AI-generated YouTube Shorts in the humor/comedy style aimed at children.\n\nKey responsibilities:\n- Use AI to generate entertaining content suitable for YouTube Shorts.\n- Focus on humor/comedy content aimed at a children's audience.\n\nIdeal skills and experience:\n- Prior experience in content creation for children.\n- Familiarity with AI content generation tools.\n- Strong understanding of humor and comedy.\n- Experience with YouTube Shorts.\n\nlink:- \ni want shorts like this",
        "skills": [
            "Graphic Design",
            "Video Editing",
            "Videography",
            "YouTube Video Editing"
        ],
        "budget": "$8\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Android Photo Collage App Development",
        "description": "I'm seeking an experienced Android developer to create a photo collage application for me. The app should allow users to use pre-designed templates and add photos from their device library.\n\nKey Features:\n- Users can select from various pre-designed templates. A \"+\" button enables users to add photos.\n- Photos can be zoomed in, zoomed out, and moved with gestures (Zoom in/out, Move around).\n- Templates can accommodate 1 or more photos without overlap.\n\nRequirements:\n- The ideal candidate should have experience developing similar applications.\n- No hosting is required.\n- No UI/UX required.\n- I should be able to easily create and add new templates using PNG images, even without much coding knowledge. This will be done by adding files to a specific folder.\n\nThe project will be ...",
        "skills": [
            "Android",
            "Mobile App Development"
        ],
        "budget": "$231\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Natural Language to DQL Query System",
        "description": "I'm looking for an expert in  who can create a system that translates performance metrics inquiries into valid DQL queries for Dynatrace. The system should leverage the technical documentation I have organized in Dropbox, which consists of 317 folders classified by topic.\n\nKey Requirements:\n- The system must be able to handle natural language questions specifically about performance metrics.\n- The system will not have a predefined way to structure the queries; it should be flexible and capable of creating custom scripts as needed.\n- The technical documentation will be updated weekly, so the system should be adaptable to incorporate new information on a regular basis.\n\nIdeal Skills and Experience:\n- Proficiency in  and Dynatrace DQL.\n- Strong natural language processing skills.\n- Exper...",
        "skills": [
            "Dropbox API",
            "Make.com",
            "OpenAI",
            "Software Architecture"
        ],
        "budget": "$192\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Investment-Ready Pitch Deck for Coworking Space",
        "description": "I'm seeking a professional with experience in creating compelling pitch decks to help me attract venture capitalists for my coworking space. The pitch deck needs to clearly communicate the business model, perform an in-depth market analysis, and lay out comprehensive financial projections. \n\nKey Requirements:\n- Strong background in financial analysis and business modeling\n- Proven experience with market research in the coworking industry\n- Prior experience creating pitch decks aimed at venture capitalists \n\nYour ability to present this information in a clear, persuasive manner could significantly impact the success of this project. Please include examples of previous pitch decks you've created, particularly those aimed at venture capitalists, in your application.",
        "skills": [
            "Business Analysis",
            "Business Plans",
            "Market Research",
            "Pitch Deck Writing",
            "Research"
        ],
        "budget": "$73\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Galaxy App Build",
        "description": "I am looking for someone to compile my html code into an android  app,  all the code is written and working, i just need it converted to an app to work on phones etc",
        "skills": [
            "Android App Development",
            "Mobile App Development"
        ],
        "budget": "$169\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "PowerPoint Business Proposal Presentation",
        "description": "I need a PowerPoint presentation for a business proposal. The key sections to be included are a comprehensive review of our work done. The presentation is intended for a client, and it's crucial that it's professional and persuasive. \n\nIdeal skills and experience for the job include:\n- Proficiency in PowerPoint\n- Experience in creating business proposal presentations\n- Excellent understanding of structuring and visualizing content\n- Strong communication skills to understand and incorporate feedback",
        "skills": [
            "Business Writing",
            "Content Writing",
            "Marketing",
            "Powerpoint",
            "Presentations"
        ],
        "budget": "$47\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Build a CityFlo.com-Style WordPress Website Using Divi for Travel Company",
        "description": "We are seeking a talented and experienced WordPress developer to design a new website for our travel business using the Divi theme (license already purchased). The new site will be for , inspired by the clean, professional look and functionality of  (the Mumbai-based ride service).\n\nOur current website is , and we want to upgrade the brand with a modern, mobile-friendly, and easy-to-navigate WordPress site under the  domain.\n\nProject Scope:\n\nBuild a WordPress website using the Divi builder.\n\nReplicate the clean and modern design style of Cityflo.com.\n\nResponsive and mobile-optimized layout.\n\nCustom homepage, service pages, and contact/booking form.\n\nFast loading, SEO-friendly structure.\n\nIntegration of customer inquiry or booking forms (can use plugins like WPForms or similar).\n\nEasy-to-ed...",
        "skills": [
            "HTML",
            "MySQL",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$253\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Professional YouTube Thumbnail Design",
        "description": "I'm looking for a talented designer to create a professional and sleek YouTube thumbnail for an entertainment-focused video. The thumbnail should reflect a minimalist approach, while still being engaging and eye-catching. \nLanguage: Any language (Tamil - Preferred)\n\nIdeal Skills:\n- Proficient in graphic design software\n- Experience with YouTube thumbnail design\n- Understanding of entertainment industry trends\n- Ability to create minimalist yet engaging designs\n\nPlease provide a portfolio of your previous work, specifically any related to YouTube thumbnails or the entertainment industry.",
        "skills": [
            "Adobe Lightroom",
            "Graphic Design",
            "Logo Design",
            "Photo Editing",
            "Photoshop"
        ],
        "budget": "$9\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Modern Residential House Design with Smart Tech",
        "description": "I'm looking for a professional with experience in modern residential architecture to assist me with the design of a house.\n\nKey Tasks Include:\n- Collecting references for house plans\n- Determining a suitable house model\n- Researching requirements for each room\n- Creating sketches\n- Detailing and including furniture and appliances\n- Developing alternative layouts\n\nIdeal Skills:\n- Proficiency in modern design principles\n- Experience with smart home technology\n- Strong research and sketching skills\n- Ability to create comprehensive and detailed plans",
        "skills": [
            "3D Rendering",
            "AutoCAD",
            "Building Architecture",
            "Home Design",
            "Interior Design"
        ],
        "budget": "$364\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Classic Label Design for HydroSip",
        "description": "I'm seeking an experienced graphic designer to create a classic-styled water bottle label for my company, HydroSip. The design should communicate a premium quality, enhancing the perceived value of our product. \n\nKey Requirements:\n- Proficiency in graphic design, ideally with experience in packaging design.\n- Understanding of classic design elements and aesthetics.\n- Ability to convey a premium message through design.\n\nPlease provide a portfolio of relevant work with your bid.",
        "skills": [
            "Brochure Design",
            "Corporate Identity",
            "Covers & Packaging",
            "Graphic Design",
            "Logo Design"
        ],
        "budget": "$15\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Printable PDF Cryptogram Maths Puzzle for Kids",
        "description": "I'm looking for a cryptogram maths puzzle based on the statement about Tidbinbilla and its role in NASA's communications with space missions. The puzzle should be designed for children aged 6 to 12, making it a fun and educational challenge.\n\nKey Requirements:\n- The puzzle should be in a printable PDF format.\n- The difficulty level should be appropriate for 6 to 12 year olds.\n- Basic math should be used as the cryptography method.\n\nIdeal Skills:\n- Experience in creating educational content for children.\n- Strong understanding of basic mathematics and cryptography.\n- Proficiency in designing printable PDF content. \n\nI would like the answer to the cryptogram to be\n\nTidbinbilla helps NASA talk to space missions. It is one of three stations that communicate with spacecraft.\n\nI have a...",
        "skills": [
            "Education & Tutoring",
            "Game Design",
            "Graphic Design",
            "Mathematics"
        ],
        "budget": "$31"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Logo & Product Label Design $35 Tops!",
        "description": "I'm looking for a designer to refine my logo, apply a gold effect, and create labels for several of my products. \n\n- Logo cleanup: I've sketched most of the logo, I just need someone to polish it and prepare various size files for me.\n- Product labels: The design work is $20 per label. You'll need to prepare different files and upload the full file and elements to my Drive folder.\n\nIf you're talented, this could lead to more work at an increased pay.",
        "skills": [
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop",
            "Photoshop Design"
        ],
        "budget": "$46\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Modern Clothing Line Designer Needed",
        "description": "I'm in need of a talented designer who can create engaging, modern designs for a clothing line that includes primarily T-shirts, but also hoodies and pants. The designs should be illustrative and suitable for embroidery.\n\nKey Requirements:\n- Design and branding for T-shirts, with some focus on hoodies and pants\n- Creation of modern, illustrative designs that can be embroidered\n- Experience in clothing design and branding\n- Strong portfolio of modern, illustrative work\n\nIncorporating Branding Elements:\n- Strategically placing the logo on designs\n- Integrating the tagline or slogan within designs\n- Designing custom tags or labels for the clothing\n\nPlease include relevant samples from your portfolio in your proposal.",
        "skills": [
            "Computerized Embroidery",
            "Photoshop",
            "Photoshop Design",
            "T-Shirts"
        ],
        "budget": "$49\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "2D Standard Rigging for VTuber Model",
        "description": "I need a professional with experience in Standard 2D Rigging for a pre-made VTuber model. The model should be rigged to convey a few specific emotes, in addition to basic expressions. \n\nSpecific expressions/emotes required:\n- Happy and Sad\n- Angry and Surprised\n- Blushing and Laughing\n\nIdeal skills for this job include:\n- Proficiency in Standard 2D Rigging\n- Experience with VTuber models\n- Ability to create a range of emotes from specific expressions \n\nThe successful freelancer will demonstrate a keen understanding of 2D rigging and will be able to deliver a well-rigged model.",
        "skills": [
            "2D Animation",
            "2D Game Art",
            "Maya"
        ],
        "budget": "$105\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "2D Animator Needed for Logo Transformation",
        "description": "I'm seeking a skilled 2D animator to bring our logo to life with complex, transformative movements. The animated logo will primarily be used over video content, so it needs to be visually engaging and versatile. \n\nKey Requirements:\n- Expertise in 2D animation\n- Experience with complex motion design\n- Ability to deliver high-quality animation suitable for video content\n\nIdeal Candidates:\n- Have a strong portfolio of 2D animations\n- Have experience with logo animation\n- Can work to a deadline and deliver high-quality work.",
        "skills": [
            "Animation",
            "Motion Graphics"
        ],
        "budget": "$198\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Azure Administrator Needed for VM & AD",
        "description": "I'm seeking an experienced Azure Administrator proficient in managing Azure Virtual Machines and Azure Active Directory. \n\nKey Responsibilities:\n- Provisioning and setting up Azure Virtual Machines.\n- Handling user management tasks within Azure Active Directory.\n- Setting up Single Sign-On (SSO) in Azure AD.\n\nIdeal Skills:\n- Extensive experience with Azure services, specifically Virtual Machines and Azure Active Directory.\n- Proficiency in the provisioning and setup of Azure Virtual Machines.\n- Expertise in user management and SSO configuration in Azure AD.\n- Strong understanding of Azure's best practices for deployment and management.",
        "skills": [
            "Amazon Web Services",
            "Azure",
            "Cloud Computing",
            "Microsoft SQL Server",
            "Windows Server"
        ],
        "budget": "$10 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "100-Year Finance Brand Website Overhaul",
        "description": "I'm looking for a comprehensive revamp of my finance-related 100 years 100-year-old legacy Brand site, which has been consistently getting admiration. The project involves both a design update and enhancing the site's usability and mobile responsiveness. The ultimate goal is to bring this legacy brand up to modern web standards while also improving its SEO.\n\nKey aspects of the project include:\n- Implementing a fresh, modern design while still respecting the brand's historical significance.\n- Enhancing the site's usability to ensure a seamless user experience.\n- Making the site fully mobile responsive to cater to today's users.\n- Comprehensive SEO improvements, covering both on-page and technical SEO, as well as link building.\n\nIdeal candidates for this project shou...",
        "skills": [
            "Graphic Design",
            "HTML",
            "Internet Marketing",
            "SEO",
            "Website Design"
        ],
        "budget": "$412\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Android Photo Capturing App Development",
        "description": "I'm looking to develop an Android app focused on capturing photos. The app should be user-friendly and capable of taking high-quality pictures. While the main purpose is photo capturing, the potential for future updates to include editing features exists, so some foresight in the design would be beneficial. \n\nIdeal skills and experience for the job include:\n- Proficiency in Android app development\n- Experience with photo capturing software development\n- Ability to design user-friendly interfaces\n- Foresight for potential future updates and features\n- Knowledge of high-quality photo capturing techniques",
        "skills": [
            "Android",
            "iPhone",
            "Java",
            "Mobile App Development",
            "Software Architecture"
        ],
        "budget": "$275\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "E-Commerce Graphic Design Specialist -- 2",
        "description": "I am looking for a seasoned Graphic Designer with a focus on E-Commerce to tailor design for my website. \n\nKey Responsibilities:\n- Design elements primarily focusing on an appealing and effective product showcase.\n- Understanding of the necessity for branding consistency across the site.\n\nThe ideal candidate should be proficient in graphic design with a strong portfolio in designing for E-Commerce websites. Skills in creating visually appealing product displays and understanding of the principles of user-friendly design and branding consistency are crucial. Experience in utilizing design to enhance product visibility and desirability is a big plus.",
        "skills": [
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop",
            "Photoshop Design"
        ],
        "budget": "$18 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Backstage.io Software Template with Terraform",
        "description": "I am in need of a  Software template which can spin up Infrastructure as Code (IaC) using Terraform on the Google Cloud Platform. The template should include the components from the provided Github link:  \n\nThe ideal freelancer for this project should have:\n- Extensive experience with  and Terraform.\n- Deep understanding of Google Cloud Platform.\n- Proficiency in using and modifying open-source Terraform modules.\n\nKey project requirements:\n- A  Software template that can create the specified infrastructure components: compute instances, networking components, and storage solutions.\n- Utilization of appropriate open-source Terraform modules to facilitate the project.",
        "skills": [
            "Google Cloud Platform",
            "Kubernetes",
            "Terraform"
        ],
        "budget": "$30 - $250"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Company Website Development from Scratch",
        "description": "I'm looking for a skilled web developer to create a comprehensive company website from the ground up. The website should be professionally designed and serve as an informative platform about our company and its services. \n\nKey Sections:\n- 20-25 pages\n- high end UX/UI design and graphics/vectors\n- Marketing material template designs \n\nIdeal Skills and Experience:\n- Proficient in web development languages (HTML, CSS, JavaScript, etc.)\n- Experienced in creating business-oriented websites\n- Good understanding of UX/UI design principles\n- Ability to convey complex information in a clear and engaging manner.",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$865\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Logo Integration in Video Footage for 4 videos And URL if needed",
        "description": "I require assistance to seamlessly integrate my business logo into four of my videos. The adjustments will include removing a mockup logo from one of the videos. \n\nKey Responsibilities:\n- Evaluate and determine the optimal placement of the logo across various videos, prioritizing aesthetics and visibility\n- Remove a mockup logo from one of the videos \n- Ensure the final product maintains high video quality and professional standards \n\nKey Details:\n- Video Length: All videos are under 1 minute \n- Video Format: All videos are in MP4 \n\nIdeal Skills and Experience:\n- Proficiency in video editing software \n- Prior experience with logo integration in videos \n- Strong understanding of visual aesthetics and branding \n- Ability to deliver high-quality work within a reasonable timeframe",
        "skills": [
            "After Effects",
            "Graphic Design",
            "Video Editing",
            "Video Production",
            "Video Services"
        ],
        "budget": "$9"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "3D Floor Renderings Expert Needed",
        "description": "We’re a dynamic and fast-growing creative agency that brings concepts to life through design, branding, and immersive visual experiences. We're currently expanding our design capabilities and looking for a talented 3D Designer who specializes in floor plans and space renderings.\n\nWhat You’ll Do:\n\nCreate high-quality 3D renderings of floor layouts for retail, commercial, and experiential spaces\n\nCollaborate with our creative and project management teams to interpret design briefs\n\nTranslate sketches, moodboards, and floor plans into realistic 3D visualizations\n\nApply textures, lighting, and realistic materials for impactful presentations\n\nIterate designs based on feedback and deliver optimized files for both web and print\n\nRequirements:\n\nProven experience with 3D rendering ...",
        "skills": [
            "3D Animation",
            "3D Design",
            "3D Modelling",
            "3D Rendering",
            "3ds Max"
        ],
        "budget": "$83\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Builders Labourer or a masonry block layer Needed",
        "description": "I need physical labor assistance for a project. The task involves moving and installing 40 off 200 series masonry blocks within a timeframe of 6 hours. \n\nIdeal Skills:\n- Physical strength and endurance\n- Ability to follow instructions\n\nPlease note, no special skills or experience are required for this job. Standard safety practices will be in place.",
        "skills": [
            "Building",
            "Masonry"
        ],
        "budget": "$9 - $16 / hr"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Modern Minimalist Single Page PHP Website",
        "description": "I'm looking for a Frontend Developer to design a custom, modern and minimalist single page website. The backend is already set up in PHP, so your focus will solely be on the frontend. \n\nKey responsibilities:\n- Create a sleek, user-friendly design that aligns with a modern and minimalist theme.\n- Incorporate text and images provided into the design in a visually appealing way.\n- Follow specific brand guidelines and color schemes that I will provide.\n\nIdeal skills and experience:\n- Proficiency in frontend web technologies (HTML, CSS, JavaScript).\n- Previous experience designing modern minimalist websites.\n- Ability to implement provided brand guidelines accurately.",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design"
        ],
        "budget": "$27\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Modern Minimalist Website UI Design",
        "description": "I'm seeking a UI designer for a modern and minimalist website. The design should be clean, user-friendly, and aesthetically pleasing, following current best practices in UI/UX design.\n\nIdeal candidates should have:\n- Proven experience in website UI design\n- Strong portfolio featuring modern, minimalist designs\n- Proficiency in design tools like Sketch, Figma, or Adobe XD\n- Understanding of responsive design principles\n\nPlease note that a detailed brief of the specific pages will be provided after selection. Your ability to translate these requirements into a sleek, intuitive design will be key to the success of this project.",
        "skills": [
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$59\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "UI/UX Design for Mobile Social Media App",
        "description": "I'm looking for a skilled UI/UX designer to help design a mobile-focused social media app. The design needs to cater to both iOS and Android platforms, ensuring a seamless user experience across devices.\n\nKey Features:\n- The app will include messaging capabilities\n- Photo and video sharing functions\n- User profiles\n\nIdeal Skills:\n- Extensive experience in designing mobile applications, particularly social media apps\n- Proficiency in designing for both iOS and Android platforms\n- Strong understanding of UI/UX principles\n- Ability to create engaging and intuitive designs\n- Preference will be given If u have US or Europe work experience\n\nExperience:\n- Previous work on messaging, photo/video sharing, and user profile features will be highly considered\n- A portfolio demonstrating successfu...",
        "skills": [
            "Graphic Design",
            "iPhone",
            "Mobile App Development",
            "User Interface / IA",
            "UX / User Experience"
        ],
        "budget": "$14 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Trade Operation Order Management System",
        "description": "Order Management System for Trading\n\nI'm seeking a developer to implement an Order Management System for my international trading company. This system will manage the entire procurement process from product catalog to vendor fulfillment and customs processing. Despite having multiple features, this is a straightforward project with exceptionally clear documentation. I've prepared detailed specifications and HTML examples for all pages, making this an organized and well-defined implementation task that can be completed quickly.\nWhat Makes This Easy\n\nMust be completed within a few days\nComprehensive, clear specifications\nHTML templates for all pages provided\nWell-defined database structure\nStep-by-step implementation instructions\n\nCore Features\n\nRole-based system (Admin, Office, Cu...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$194\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Vintage Cafe Logo Design -- 2",
        "description": "I'm looking for a vintage-style logo for my cafe. The logo should incorporate the name of the cafe and the establishment year. \n\nKey Aspects:\n- Style: The logo must reflect a vintage aesthetic, so understanding of vintage design elements is crucial.\n- Content: The cafe name and establishment year must be included.\n- Color Scheme: The logo should utilize warm tones, such as browns and oranges. \n\nIdeal candidates will have a portfolio showcasing similar vintage design work, with a strong understanding of color and composition. Experience in logo design is a must.",
        "skills": [
            "3D Design",
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop"
        ],
        "budget": "$50 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "For making online presence for my finance company",
        "description": "I need a skilled web developer to build an informative website for my company. The site should encompass several key sections: 'About Us', 'Services', 'Contact Us', 'Home', 'Calculators', and 'Book Appointment'.\n\nKey Requirements:\n- Comprehensive understanding of web development\n- Prior experience in creating informational websites\n- Ability to integrate interactive elements like calculators and booking forms\n- Proficiency in ensuring the website is user-friendly and accessible\n\nThe primary objective of this website is to relay important company information to our visitors. Therefore, a knack for presenting information in an engaging and clear manner will be greatly appreciated.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$237\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Instructional Video Editing for Fitness Pros",
        "description": "I'm looking for a skilled video editor to turn raw footage from gyms, trainers, and fitness influencers into clean, engaging instructional videos.\n\nWhat I Need:\nEdit and improve the clarity and flow of workout/instructional content\n\nCreate content that's well-suited for YouTube's audience\n\nAdd clean transitions, pacing, and visuals to keep viewers engaged\n\nSkills:\nProficiency in any video editing software\n\nGood understanding of YouTube video style and viewer expectations\n\nStrong sense of timing and storytelling through visuals\n\nYour edits will help reach fitness lovers and make our content both helpful and engaging.",
        "skills": [
            "Editing",
            "Video Editing",
            "Video Production",
            "Video Services",
            "Videography"
        ],
        "budget": "$13\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Nursery Rhymes Video Songs For Preschool Kids #6",
        "description": "I'm looking for someone who is smart and can record some action songs for preschool kids. No previous experience is required. You can use your phone camera to record the videos.\n\nYou only have to act/dance based on the songs we provide. You will get the payments for each video song you record.\n\nIt's just 3-5 minute long videos and it depends on the song.\n\nPlease take a look at the example videos:\n\n============== ============== ==============\n\n============== ============== ==============\n\nNOTE: I will provide you with all the reference song for each video.\nAlso, you must be in SAREE for more professional looks.",
        "skills": [
            "Copy Typing",
            "Customer Support",
            "Data Entry",
            "Virtual Assistant",
            "Word"
        ],
        "budget": "$2 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs",
        "title": "Abaqus Structural Analysis Expert Needed",
        "description": "I'm seeking an experienced professional in Abaqus for a comprehensive structural analysis. I need to understand the stress distribution, deformation patterns, and potential failure points of a given structure. \n\nKey Requirements:\n- Proficient in Abaqus for structural analysis\n- Able to simulate and interpret stress distribution\n- Capable of identifying deformation patterns and failure points\n\nAdditionally, the simulation should incorporate relevant material properties, specifically:\n- Elasticity\n- Plasticity\n\nIdeal Skills:\n- Expertise in structural analysis simulations\n- Strong understanding of material properties\n- Excellent interpretation and reporting skills\n\nThe successful candidate will provide insights based on the simulation results and help in understanding the structural inte...",
        "skills": [
            "Engineering",
            "Finite Element Analysis",
            "Mechanical Engineering",
            "Statistical Analysis",
            "Structural Engineering"
        ],
        "budget": "$21\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Instrumental Performance for E-Commercial Video",
        "description": "I'm a producer based in West LA, currently seeking a talented musician to perform on an Amazon e-commercial video. The project involves playing either the piano, guitar, or drums for a small opening box video of a musical instrument store.\n\nKey project details: \n- Instrument: Either piano, guitar, or drums (specific instrument will be determined based on the freelancer's skills)\n- Experience Level: Basic - Advanced level is acceptable\n- Melodies: Provide 3 melodies including an American pop song, each 60 seconds long\n- Attire: Two different outfits, to be prepared by the freelancer\n- Compensation: $120, negotiable based on skill level, paid via Zelle/PayPal\n\nShooting Schedule:\n- Duration: 4-5 hours\n- Dates: One of the days between April 3 - April 12\n\nShooting Details:\n- Content: ...",
        "skills": [
            "Audio Services",
            "Music"
        ],
        "budget": "$100\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Showreel Creation with Nuke Software",
        "description": "I need a nuke showreel done \n\n? Project Ideas for Your Nuke Showreel\nGreen Screen Replacement\n\nActor on green screen composited into a 3D or live-action background.\n\nWire Removal / Rig Cleanup\n\nAction scene with harnesses or rigs removed using paint & tracking.\n\nCG Integration\n\nA 3D robot, vehicle, or object composited into live-action footage with proper shadows, reflections, and grading.\n\nDay to Night Conversion\n\nTransform a daytime scene into a believable night scene.\n\nSet Extension / Matte Painting\n\nAdd extra buildings, landscapes, or sky replacements to a limited live-action set.\n\nMatchmoving with 3D Elements\n\nCamera-tracked scene with added 3D objects or environment pieces (animated or static).\n\nScreen Replacement\n\nPhone, TV, or monitor screen replaced with tracked content and mo...",
        "skills": [
            "3D Modelling",
            "3D Rendering",
            "After Effects",
            "Maya",
            "Video Editing"
        ],
        "budget": "$17 - $145"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Barcode Scanner App & Website Creation",
        "description": "We are looking to develop a barcode scanner app and an integrated website, inspired by the YUKA App and yuka.io. The primary function of the barcode scanner will be product lookup and color/score ratings based on ingredients and manufacturer's location.\n\nKey Features of the App:\n\n- Premium Features: There will be a donation-based model to unlock premium features where users will also be prompted to sign in for an account. This includes access to scan history, favorites, recommendations, product search, etc.\n- User Accounts: Users should be able to create their own accounts on App and manage the same integrated data on the website with same login credentials.\n- Product Search: Premium users should be able to search for products by name or category on both App and website.\n- Color Ratin...",
        "skills": [
            "Android",
            "iOS Development",
            "Mobile App Development",
            "MySQL",
            "PHP"
        ],
        "budget": "$14241\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "App Submission Expert Needed for iOS & Android",
        "description": "I am seeking a seasoned professional to assist with the submission of my app to both the Apple App Store and Google Play Store. All necessary materials, including screenshots, icons, feature graphics, privacy policies, and descriptions, will be provided. \n\nThe ideal candidate should:\n- Have proven experience in app submission to both platforms\n- Be familiar with the submission process and requirements of both stores\n- Able to ensure optimal presentation of the app in the stores\n\nMy app has already been tested for compliance with both stores' guidelines and I have developer accounts set up for both. Your role will simply be to facilitate the submission process. \n\nPlease submit your bid with a brief overview of your relevant experience. I look forward to working with you.",
        "skills": [
            "Android",
            "iPad",
            "iPhone",
            "Mobile App Development",
            "Mobile App Testing"
        ],
        "budget": "$457\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Elegant Logo & Beauty Packaging Design",
        "description": "I'm in need of a talented designer to create a classic and elegant logo and packaging for a beauty and cosmetics product. \nKey Requirements:\n- Design a sophisticated and timeless logo that reflects the elegance of the brand.\n- Create designs for both primary packaging (like jars or bottles) and secondary packaging (like outer boxes). \nIdeal Skills:\n- Extensive experience in logo and packaging design, particularly in the beauty and cosmetics industry.\n- A strong portfolio showcasing modern, clean, classic and elegant design aesthetics.\n- Ability to understand and translate brand values into design elements.",
        "skills": [
            "Corporate Identity",
            "Covers & Packaging",
            "Graphic Design",
            "Logo Design",
            "Photoshop"
        ],
        "budget": "$59\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Social Media Engagement Report Designer",
        "description": "I am seeking a professional who can design a comprehensive social media report template focusing on engagement metrics from Facebook and Instagram. We currently use AgoraPulse. The calculations are not always accurate. I need a solution to track metrics for FB & IG month to month that calculations populate as i make edits. The report should be presented as a well-structured PDF document. \n\nIdeal skills for this project include:\n- Proficiency in data analysis\n- Experience with social media metrics\n- Graphic design skills for creating visually appealing PDF reports \n\nPlease include samples of previous similar work in your proposal.",
        "skills": [
            "Brochure Design",
            "Excel",
            "Graphic Design",
            "Photoshop",
            "Powerpoint"
        ],
        "budget": "$333\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Shopify Store Revamp",
        "description": "I'm seeking a proficient Shopify developer to revamp my site, elladean.com. The goal is to modernize its appearance, enhance user navigation and product display, and implement a high-converting layout and structure inspired by this Shopify theme:",
        "skills": [
            "eCommerce",
            "Shopify",
            "Shopify Development",
            "Shopify Templates",
            "Shopping Cart Integration"
        ],
        "budget": "$428\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Physics Exam class 11 and class 12",
        "description": "I'm seeking a physics specialist to help me tackle problems from my class 11 and 12 curriculum. The focus will be on preparing for upcoming exams, so experience with this level of physics is essential.",
        "skills": [
            "Physics",
            "Physics Tutoring"
        ],
        "budget": "$54\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Comprehensive HR Support for Hiring & Onboarding",
        "description": "I'm seeking an experienced HR professional to assist with our hiring and onboarding processes. Your main responsibilities will include resume screening, interview scheduling, and managing various other HR operations. The roles we are looking to fill range from junior to mid-level positions. \n\nKey Responsibilities:\n- Resume screening and interview scheduling for both junior and mid-level positions\n- Overseeing onboarding processes including orientation sessions, paperwork and documentation, as well as training and development planning\n\nIdeal Skills:\n- Strong background in Human Resources Management\n- Proven experience in hiring and onboarding processes\n- Excellent communication and organizational skills\n- Previous background in manufacturing industry preferred\n\nYour role will be crucia...",
        "skills": [
            "Business Writing",
            "Report Writing",
            "Research Writing",
            "Resumes",
            "Technical Writing"
        ],
        "budget": "$290\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Portrait Face & Hair Color Swap",
        "description": "I need an expert in photo editing and color correction to help me swap my face into a portrait of someone else, as well as changing my hair color to match seamlessly. \n\nKey Requirements:\n- Face Swap: You will need to replace the existing face in the portrait with mine.\n- Hair Color Change: My hair color will also need to be changed to fit the photo. This should be done in a natural and subtle way, rather than a dramatic or noticeable change.\n\nIdeal Skills:\n- Proficiency in advanced photo editing software (like Photoshop)\n- Prior experience with similar face and hair color swaps\n- Excellent understanding of color matching and blending\n- Strong attention to detail for a realistic final product",
        "skills": [
            "Graphic Design",
            "Photo Editing",
            "Photography",
            "Photoshop",
            "Photoshop Design"
        ],
        "budget": "$26\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Flutter & Kotlin Expert: WebRTC & OpenAI Integration",
        "description": "I'm seeking a seasoned mobile developer with extensive experience in Flutter and Kotlin. The task is to integrate existing code for a WebRTC-based 1:1 video call and OpenAI Whisper-based voice processing. \n\nKey Details:\n- The integration primarily involves post-call voice analysis with OpenAI Whisper.\n- The WebRTC SDK will be used for both video and voice calling, although the current focus is predominantly on 1:1 video calls.\n\nImportant:\n- Only serious experts should apply, as this could lead to a long-term collaboration.\n- A prior experience with the WebRTC SDK is mandatory. Your skills will be evaluated through a test to ensure you are a genuine long-term developer.\n- Please note that applications from individuals without this specific experience will be reported as spam.",
        "skills": [
            "Android",
            "iPhone",
            "JavaScript",
            "Mobile App Development",
            "PHP"
        ],
        "budget": "$238\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Script Writer for Real Estate & Tech YouTube Channel",
        "description": "I'm on the lookout for a talented scriptwriter who can craft engaging scripts and YouTube/video descriptions for my channel with keyword insertion to them for the SEO. This is a consistent, ongoing project where keywords will be embedded to multiple scripts will be needed weekly.\n\nKey Responsibilities:\n- Embed given keywords naturally and effectively (Adding minimum 40 keywords)\n- Adhere to provided tone and format\n\nMy favourite animal is Panda.\n\nIdeal Skills:\n- Strong writing skills\n- Ability to understand and write for different formats and tones\n- Experience or interest in real estate and tech\n- SEO knowledge (for keyword embedding)\n\nIf you are replying to this job post, let me know what my favourite animal is at the end.\n\nThe perfect candidate should be able to deliver high-qualit...",
        "skills": [
            "Catch Phrases",
            "Content Writing",
            "Copywriting",
            "Keyword Research"
        ],
        "budget": "$12 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Sleek Modern Packaging Design",
        "description": "I'm seeking a professional packaging designer to create a modern and sleek design for boxes packaging. I have 14 different designs, each with a unique name and logo, but they all share the same size.\n\nKey requirements:\n- The packaging must include the product name and logo, usage instructions, and nutritional information.\n- Ideal candidates should have a strong portfolio of modern and sleek packaging designs.\n- Experience with designing for blister packs is a plus.\n\nPlease show your work\n\nref attached (the ref photo is not my brand but I want to make similar)",
        "skills": [
            "Corporate Identity",
            "Covers & Packaging",
            "Graphic Design",
            "Logo Design",
            "Packaging Design"
        ],
        "budget": "$193\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Tamil Voice Over for Promotional Video",
        "description": "I'm looking for a talented voice artist who can convert English text voice into Tamil voice for a less than 5 minute promotional video. \n\nKey Requirements:\n- The Tamil voice should be similar to the original English voice but with necessary cultural adjustments. \n- The voice over should match the tone and style of the English voice but be adapted for a Tamil audience.\n- Previous experience with voice overs for promotional videos is preferred.\n\nSkills and Experience:\n- Proficiency in English and Tamil.\n- Experience in voice acting and audio production.\n- Ability to understand and implement cultural adjustments in tone and style.\n\nPlease provide samples of your previous work.",
        "skills": [
            "Audio Production",
            "Audio Services",
            "Commercials",
            "Hindi Translator",
            "Voice Talent"
        ],
        "budget": "$7 - $17"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Startup Medical Company Admin Support",
        "description": "I'm seeking a multitasking professional to assist with various administrative tasks for a startup medical company. Your primary responsibilities will include taking requests for information, finding financial sponsors, and general personal assistant tasks.\n\nKey Responsibilities:\n- Taking requests for information related to capital equipment and soft costs.\n- Seeking financial sponsors to facilitate a lease.\n- Assisting with personal guarantor search for deposit.\n- Performing general personal assistant tasks.\n- Finding and coodinating other freelancers for video, photo optimization, organization, and not trying to do it all on thier own via scope creep.\n\nYour English proficiency is crucial, particularly when finding financial sponsors. You will also be responsible for scheduling meetin...",
        "skills": [
            "Organization Design",
            "Telemarketing"
        ],
        "budget": "$18\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Running Shoe Design",
        "description": "I have a shoe model just looking to add some design on to it",
        "skills": [
            "3D Modelling",
            "3D Rendering",
            "Graphic Design",
            "Solidworks",
            "Website Design"
        ],
        "budget": "$75\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Wikipedia Page Creation for Company",
        "description": "I need a Wikipedia page for my client company. The page should focus primarily on the company's history, including the founding date and background of the founders, as well as major achievements throughout the company's journey. \n\nKey Responsibilities:\n- Craft a comprehensive and compelling company history\n- Identify and incorporate key milestones and major achievements\n- Ensure all information is sourced from reliable references\n\nIdeal Skills and Experience:\n- Proven experience in creating Wikipedia pages\n- Excellent research skills to find and verify information\n- Strong writing skills to present the information in an engaging way\n\nPlease note, I currently do not have reliable sources for this information and will need your expertise in finding appropriate references.",
        "skills": [
            "Article Writing",
            "Copywriting",
            "Ghostwriting",
            "Research",
            "Research Writing"
        ],
        "budget": "$132\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "AI-Generated Comedy YouTube Shorts for Kids",
        "description": "I'm looking for a talented freelancer who can create AI-generated YouTube Shorts in the humor/comedy style aimed at children.\n\nKey responsibilities:\n- Use AI to generate entertaining content suitable for YouTube Shorts.\n- Focus on humor/comedy content aimed at a children's audience.\n\nIdeal skills and experience:\n- Prior experience in content creation for children.\n- Familiarity with AI content generation tools.\n- Strong understanding of humor and comedy.\n- Experience with YouTube Shorts.\n\nlink:- \ni want shorts like this",
        "skills": [
            "Graphic Design",
            "Video Editing",
            "Videography",
            "YouTube Video Editing"
        ],
        "budget": "$8\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Android Photo Collage App Development",
        "description": "I'm seeking an experienced Android developer to create a photo collage application for me. The app should allow users to use pre-designed templates and add photos from their device library.\n\nKey Features:\n- Users can select from various pre-designed templates. A \"+\" button enables users to add photos.\n- Photos can be zoomed in, zoomed out, and moved with gestures (Zoom in/out, Move around).\n- Templates can accommodate 1 or more photos without overlap.\n\nRequirements:\n- The ideal candidate should have experience developing similar applications.\n- No hosting is required.\n- No UI/UX required.\n- I should be able to easily create and add new templates using PNG images, even without much coding knowledge. This will be done by adding files to a specific folder.\n\nThe project will be ...",
        "skills": [
            "Android",
            "Mobile App Development"
        ],
        "budget": "$232\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Natural Language to DQL Query System",
        "description": "I'm looking for an expert in  who can create a system that translates performance metrics inquiries into valid DQL queries for Dynatrace. The system should leverage the technical documentation I have organized in Dropbox, which consists of 317 folders classified by topic.\n\nKey Requirements:\n- The system must be able to handle natural language questions specifically about performance metrics.\n- The system will not have a predefined way to structure the queries; it should be flexible and capable of creating custom scripts as needed.\n- The technical documentation will be updated weekly, so the system should be adaptable to incorporate new information on a regular basis.\n\nIdeal Skills and Experience:\n- Proficiency in  and Dynatrace DQL.\n- Strong natural language processing skills.\n- Exper...",
        "skills": [
            "Dropbox API",
            "Make.com",
            "OpenAI",
            "Software Architecture"
        ],
        "budget": "$213\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Investment-Ready Pitch Deck for Coworking Space",
        "description": "I'm seeking a professional with experience in creating compelling pitch decks to help me attract venture capitalists for my coworking space. The pitch deck needs to clearly communicate the business model, perform an in-depth market analysis, and lay out comprehensive financial projections. \n\nKey Requirements:\n- Strong background in financial analysis and business modeling\n- Proven experience with market research in the coworking industry\n- Prior experience creating pitch decks aimed at venture capitalists \n\nYour ability to present this information in a clear, persuasive manner could significantly impact the success of this project. Please include examples of previous pitch decks you've created, particularly those aimed at venture capitalists, in your application.",
        "skills": [
            "Business Analysis",
            "Business Plans",
            "Market Research",
            "Pitch Deck Writing",
            "Research"
        ],
        "budget": "$73\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Galaxy App Build",
        "description": "I am looking for someone to compile my html code into an android  app,  all the code is written and working, i just need it converted to an app to work on phones etc",
        "skills": [
            "Android App Development",
            "Mobile App Development"
        ],
        "budget": "$170\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "PowerPoint Business Proposal Presentation",
        "description": "I need a PowerPoint presentation for a business proposal. The key sections to be included are a comprehensive review of our work done. The presentation is intended for a client, and it's crucial that it's professional and persuasive. \n\nIdeal skills and experience for the job include:\n- Proficiency in PowerPoint\n- Experience in creating business proposal presentations\n- Excellent understanding of structuring and visualizing content\n- Strong communication skills to understand and incorporate feedback",
        "skills": [
            "Business Writing",
            "Content Writing",
            "Marketing",
            "Powerpoint",
            "Presentations"
        ],
        "budget": "$55\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Build a CityFlo.com-Style WordPress Website Using Divi for Travel Company",
        "description": "We are seeking a talented and experienced WordPress developer to design a new website for our travel business using the Divi theme (license already purchased). The new site will be for , inspired by the clean, professional look and functionality of  (the Mumbai-based ride service).\n\nOur current website is , and we want to upgrade the brand with a modern, mobile-friendly, and easy-to-navigate WordPress site under the  domain.\n\nProject Scope:\n\nBuild a WordPress website using the Divi builder.\n\nReplicate the clean and modern design style of Cityflo.com.\n\nResponsive and mobile-optimized layout.\n\nCustom homepage, service pages, and contact/booking form.\n\nFast loading, SEO-friendly structure.\n\nIntegration of customer inquiry or booking forms (can use plugins like WPForms or similar).\n\nEasy-to-ed...",
        "skills": [
            "HTML",
            "MySQL",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$245\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Professional YouTube Thumbnail Design",
        "description": "I'm looking for a talented designer to create a professional and sleek YouTube thumbnail for an entertainment-focused video. The thumbnail should reflect a minimalist approach, while still being engaging and eye-catching. \nLanguage: Any language (Tamil - Preferred)\n\nIdeal Skills:\n- Proficient in graphic design software\n- Experience with YouTube thumbnail design\n- Understanding of entertainment industry trends\n- Ability to create minimalist yet engaging designs\n\nPlease provide a portfolio of your previous work, specifically any related to YouTube thumbnails or the entertainment industry.",
        "skills": [
            "Adobe Lightroom",
            "Graphic Design",
            "Logo Design",
            "Photo Editing",
            "Photoshop"
        ],
        "budget": "$9\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Modern Residential House Design with Smart Tech",
        "description": "I'm looking for a professional with experience in modern residential architecture to assist me with the design of a house.\n\nKey Tasks Include:\n- Collecting references for house plans\n- Determining a suitable house model\n- Researching requirements for each room\n- Creating sketches\n- Detailing and including furniture and appliances\n- Developing alternative layouts\n\nIdeal Skills:\n- Proficiency in modern design principles\n- Experience with smart home technology\n- Strong research and sketching skills\n- Ability to create comprehensive and detailed plans",
        "skills": [
            "3D Rendering",
            "AutoCAD",
            "Building Architecture",
            "Home Design",
            "Interior Design"
        ],
        "budget": "$355\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Classic Label Design for HydroSip",
        "description": "I'm seeking an experienced graphic designer to create a classic-styled water bottle label for my company, HydroSip. The design should communicate a premium quality, enhancing the perceived value of our product. \n\nKey Requirements:\n- Proficiency in graphic design, ideally with experience in packaging design.\n- Understanding of classic design elements and aesthetics.\n- Ability to convey a premium message through design.\n\nPlease provide a portfolio of relevant work with your bid.",
        "skills": [
            "Brochure Design",
            "Corporate Identity",
            "Covers & Packaging",
            "Graphic Design",
            "Logo Design"
        ],
        "budget": "$15\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Printable PDF Cryptogram Maths Puzzle for Kids",
        "description": "I'm looking for a cryptogram maths puzzle based on the statement about Tidbinbilla and its role in NASA's communications with space missions. The puzzle should be designed for children aged 6 to 12, making it a fun and educational challenge.\n\nKey Requirements:\n- The puzzle should be in a printable PDF format.\n- The difficulty level should be appropriate for 6 to 12 year olds.\n- Basic math should be used as the cryptography method.\n\nIdeal Skills:\n- Experience in creating educational content for children.\n- Strong understanding of basic mathematics and cryptography.\n- Proficiency in designing printable PDF content. \n\nI would like the answer to the cryptogram to be\n\nTidbinbilla helps NASA talk to space missions. It is one of three stations that communicate with spacecraft.\n\nI have a...",
        "skills": [
            "Education & Tutoring",
            "Game Design",
            "Graphic Design",
            "Mathematics"
        ],
        "budget": "$31"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Logo & Product Label Design $35 Tops!",
        "description": "I'm looking for a designer to refine my logo, apply a gold effect, and create labels for several of my products. \n\n- Logo cleanup: I've sketched most of the logo, I just need someone to polish it and prepare various size files for me.\n- Product labels: The design work is $20 per label. You'll need to prepare different files and upload the full file and elements to my Drive folder.\n\nIf you're talented, this could lead to more work at an increased pay.",
        "skills": [
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop",
            "Photoshop Design"
        ],
        "budget": "$47\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Modern Clothing Line Designer Needed",
        "description": "I'm in need of a talented designer who can create engaging, modern designs for a clothing line that includes primarily T-shirts, but also hoodies and pants. The designs should be illustrative and suitable for embroidery.\n\nKey Requirements:\n- Design and branding for T-shirts, with some focus on hoodies and pants\n- Creation of modern, illustrative designs that can be embroidered\n- Experience in clothing design and branding\n- Strong portfolio of modern, illustrative work\n\nIncorporating Branding Elements:\n- Strategically placing the logo on designs\n- Integrating the tagline or slogan within designs\n- Designing custom tags or labels for the clothing\n\nPlease include relevant samples from your portfolio in your proposal.",
        "skills": [
            "Computerized Embroidery",
            "Photoshop",
            "Photoshop Design",
            "T-Shirts"
        ],
        "budget": "$49\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "2D Standard Rigging for VTuber Model",
        "description": "I need a professional with experience in Standard 2D Rigging for a pre-made VTuber model. The model should be rigged to convey a few specific emotes, in addition to basic expressions. \n\nSpecific expressions/emotes required:\n- Happy and Sad\n- Angry and Surprised\n- Blushing and Laughing\n\nIdeal skills for this job include:\n- Proficiency in Standard 2D Rigging\n- Experience with VTuber models\n- Ability to create a range of emotes from specific expressions \n\nThe successful freelancer will demonstrate a keen understanding of 2D rigging and will be able to deliver a well-rigged model.",
        "skills": [
            "2D Animation",
            "2D Game Art",
            "Maya"
        ],
        "budget": "$107\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "2D Animator Needed for Logo Transformation",
        "description": "I'm seeking a skilled 2D animator to bring our logo to life with complex, transformative movements. The animated logo will primarily be used over video content, so it needs to be visually engaging and versatile. \n\nKey Requirements:\n- Expertise in 2D animation\n- Experience with complex motion design\n- Ability to deliver high-quality animation suitable for video content\n\nIdeal Candidates:\n- Have a strong portfolio of 2D animations\n- Have experience with logo animation\n- Can work to a deadline and deliver high-quality work.",
        "skills": [
            "Animation",
            "Motion Graphics"
        ],
        "budget": "$204\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Azure Administrator Needed for VM & AD",
        "description": "I'm seeking an experienced Azure Administrator proficient in managing Azure Virtual Machines and Azure Active Directory. \n\nKey Responsibilities:\n- Provisioning and setting up Azure Virtual Machines.\n- Handling user management tasks within Azure Active Directory.\n- Setting up Single Sign-On (SSO) in Azure AD.\n\nIdeal Skills:\n- Extensive experience with Azure services, specifically Virtual Machines and Azure Active Directory.\n- Proficiency in the provisioning and setup of Azure Virtual Machines.\n- Expertise in user management and SSO configuration in Azure AD.\n- Strong understanding of Azure's best practices for deployment and management.",
        "skills": [
            "Amazon Web Services",
            "Azure",
            "Cloud Computing",
            "Microsoft SQL Server",
            "Windows Server"
        ],
        "budget": "$10 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "100-Year Finance Brand Website Overhaul",
        "description": "I'm looking for a comprehensive revamp of my finance-related 100 years 100-year-old legacy Brand site, which has been consistently getting admiration. The project involves both a design update and enhancing the site's usability and mobile responsiveness. The ultimate goal is to bring this legacy brand up to modern web standards while also improving its SEO.\n\nKey aspects of the project include:\n- Implementing a fresh, modern design while still respecting the brand's historical significance.\n- Enhancing the site's usability to ensure a seamless user experience.\n- Making the site fully mobile responsive to cater to today's users.\n- Comprehensive SEO improvements, covering both on-page and technical SEO, as well as link building.\n\nIdeal candidates for this project shou...",
        "skills": [
            "Graphic Design",
            "HTML",
            "Internet Marketing",
            "SEO",
            "Website Design"
        ],
        "budget": "$412\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Android Photo Capturing App Development",
        "description": "I'm looking to develop an Android app focused on capturing photos. The app should be user-friendly and capable of taking high-quality pictures. While the main purpose is photo capturing, the potential for future updates to include editing features exists, so some foresight in the design would be beneficial. \n\nIdeal skills and experience for the job include:\n- Proficiency in Android app development\n- Experience with photo capturing software development\n- Ability to design user-friendly interfaces\n- Foresight for potential future updates and features\n- Knowledge of high-quality photo capturing techniques",
        "skills": [
            "Android",
            "iPhone",
            "Java",
            "Mobile App Development",
            "Software Architecture"
        ],
        "budget": "$275\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "E-Commerce Graphic Design Specialist -- 2",
        "description": "I am looking for a seasoned Graphic Designer with a focus on E-Commerce to tailor design for my website. \n\nKey Responsibilities:\n- Design elements primarily focusing on an appealing and effective product showcase.\n- Understanding of the necessity for branding consistency across the site.\n\nThe ideal candidate should be proficient in graphic design with a strong portfolio in designing for E-Commerce websites. Skills in creating visually appealing product displays and understanding of the principles of user-friendly design and branding consistency are crucial. Experience in utilizing design to enhance product visibility and desirability is a big plus.",
        "skills": [
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop",
            "Photoshop Design"
        ],
        "budget": "$18 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Backstage.io Software Template with Terraform",
        "description": "I am in need of a  Software template which can spin up Infrastructure as Code (IaC) using Terraform on the Google Cloud Platform. The template should include the components from the provided Github link:  \n\nThe ideal freelancer for this project should have:\n- Extensive experience with  and Terraform.\n- Deep understanding of Google Cloud Platform.\n- Proficiency in using and modifying open-source Terraform modules.\n\nKey project requirements:\n- A  Software template that can create the specified infrastructure components: compute instances, networking components, and storage solutions.\n- Utilization of appropriate open-source Terraform modules to facilitate the project.",
        "skills": [
            "Google Cloud Platform",
            "Kubernetes",
            "Terraform"
        ],
        "budget": "$30 - $250"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Company Website Development from Scratch",
        "description": "I'm looking for a skilled web developer to create a comprehensive company website from the ground up. The website should be professionally designed and serve as an informative platform about our company and its services. \n\nKey Sections:\n- 20-25 pages\n- high end UX/UI design and graphics/vectors\n- Marketing material template designs \n\nIdeal Skills and Experience:\n- Proficient in web development languages (HTML, CSS, JavaScript, etc.)\n- Experienced in creating business-oriented websites\n- Good understanding of UX/UI design principles\n- Ability to convey complex information in a clear and engaging manner.",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$865\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Logo Integration in Video Footage for 4 videos And URL if needed",
        "description": "I require assistance to seamlessly integrate my business logo into four of my videos. The adjustments will include removing a mockup logo from one of the videos. \n\nKey Responsibilities:\n- Evaluate and determine the optimal placement of the logo across various videos, prioritizing aesthetics and visibility\n- Remove a mockup logo from one of the videos \n- Ensure the final product maintains high video quality and professional standards \n\nKey Details:\n- Video Length: All videos are under 1 minute \n- Video Format: All videos are in MP4 \n\nIdeal Skills and Experience:\n- Proficiency in video editing software \n- Prior experience with logo integration in videos \n- Strong understanding of visual aesthetics and branding \n- Ability to deliver high-quality work within a reasonable timeframe",
        "skills": [
            "After Effects",
            "Graphic Design",
            "Video Editing",
            "Video Production",
            "Video Services"
        ],
        "budget": "$9"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "3D Floor Renderings Expert Needed",
        "description": "We’re a dynamic and fast-growing creative agency that brings concepts to life through design, branding, and immersive visual experiences. We're currently expanding our design capabilities and looking for a talented 3D Designer who specializes in floor plans and space renderings.\n\nWhat You’ll Do:\n\nCreate high-quality 3D renderings of floor layouts for retail, commercial, and experiential spaces\n\nCollaborate with our creative and project management teams to interpret design briefs\n\nTranslate sketches, moodboards, and floor plans into realistic 3D visualizations\n\nApply textures, lighting, and realistic materials for impactful presentations\n\nIterate designs based on feedback and deliver optimized files for both web and print\n\nRequirements:\n\nProven experience with 3D rendering ...",
        "skills": [
            "3D Animation",
            "3D Design",
            "3D Modelling",
            "3D Rendering",
            "3ds Max"
        ],
        "budget": "$83\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Builders Labourer or a masonry block layer Needed",
        "description": "I need physical labor assistance for a project. The task involves moving and installing 40 off 200 series masonry blocks within a timeframe of 6 hours. \n\nIdeal Skills:\n- Physical strength and endurance\n- Ability to follow instructions\n\nPlease note, no special skills or experience are required for this job. Standard safety practices will be in place.",
        "skills": [
            "Building",
            "Masonry"
        ],
        "budget": "$9 - $16 / hr"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Modern Minimalist Single Page PHP Website",
        "description": "I'm looking for a Frontend Developer to design a custom, modern and minimalist single page website. The backend is already set up in PHP, so your focus will solely be on the frontend. \n\nKey responsibilities:\n- Create a sleek, user-friendly design that aligns with a modern and minimalist theme.\n- Incorporate text and images provided into the design in a visually appealing way.\n- Follow specific brand guidelines and color schemes that I will provide.\n\nIdeal skills and experience:\n- Proficiency in frontend web technologies (HTML, CSS, JavaScript).\n- Previous experience designing modern minimalist websites.\n- Ability to implement provided brand guidelines accurately.",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design"
        ],
        "budget": "$30\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Modern Minimalist Website UI Design",
        "description": "I'm seeking a UI designer for a modern and minimalist website. The design should be clean, user-friendly, and aesthetically pleasing, following current best practices in UI/UX design.\n\nIdeal candidates should have:\n- Proven experience in website UI design\n- Strong portfolio featuring modern, minimalist designs\n- Proficiency in design tools like Sketch, Figma, or Adobe XD\n- Understanding of responsive design principles\n\nPlease note that a detailed brief of the specific pages will be provided after selection. Your ability to translate these requirements into a sleek, intuitive design will be key to the success of this project.",
        "skills": [
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$65\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "UI/UX Design for Mobile Social Media App",
        "description": "I'm looking for a skilled UI/UX designer to help design a mobile-focused social media app. The design needs to cater to both iOS and Android platforms, ensuring a seamless user experience across devices.\n\nKey Features:\n- The app will include messaging capabilities\n- Photo and video sharing functions\n- User profiles\n\nIdeal Skills:\n- Extensive experience in designing mobile applications, particularly social media apps\n- Proficiency in designing for both iOS and Android platforms\n- Strong understanding of UI/UX principles\n- Ability to create engaging and intuitive designs\n- Preference will be given If u have US or Europe work experience\n\nExperience:\n- Previous work on messaging, photo/video sharing, and user profile features will be highly considered\n- A portfolio demonstrating successfu...",
        "skills": [
            "Graphic Design",
            "iPhone",
            "Mobile App Development",
            "User Interface / IA",
            "UX / User Experience"
        ],
        "budget": "$14 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Trade Operation Order Management System",
        "description": "Order Management System for Trading\n\nI'm seeking a developer to implement an Order Management System for my international trading company. This system will manage the entire procurement process from product catalog to vendor fulfillment and customs processing. Despite having multiple features, this is a straightforward project with exceptionally clear documentation. I've prepared detailed specifications and HTML examples for all pages, making this an organized and well-defined implementation task that can be completed quickly.\nWhat Makes This Easy\n\nMust be completed within a few days\nComprehensive, clear specifications\nHTML templates for all pages provided\nWell-defined database structure\nStep-by-step implementation instructions\n\nCore Features\n\nRole-based system (Admin, Office, Cu...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$194\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Vintage Cafe Logo Design -- 2",
        "description": "I'm looking for a vintage-style logo for my cafe. The logo should incorporate the name of the cafe and the establishment year. \n\nKey Aspects:\n- Style: The logo must reflect a vintage aesthetic, so understanding of vintage design elements is crucial.\n- Content: The cafe name and establishment year must be included.\n- Color Scheme: The logo should utilize warm tones, such as browns and oranges. \n\nIdeal candidates will have a portfolio showcasing similar vintage design work, with a strong understanding of color and composition. Experience in logo design is a must.",
        "skills": [
            "3D Design",
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop"
        ],
        "budget": "$50 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "For making online presence for my finance company",
        "description": "I need a skilled web developer to build an informative website for my company. The site should encompass several key sections: 'About Us', 'Services', 'Contact Us', 'Home', 'Calculators', and 'Book Appointment'.\n\nKey Requirements:\n- Comprehensive understanding of web development\n- Prior experience in creating informational websites\n- Ability to integrate interactive elements like calculators and booking forms\n- Proficiency in ensuring the website is user-friendly and accessible\n\nThe primary objective of this website is to relay important company information to our visitors. Therefore, a knack for presenting information in an engaging and clear manner will be greatly appreciated.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$237\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Instructional Video Editing for Fitness Pros",
        "description": "I'm looking for a skilled video editor to turn raw footage from gyms, trainers, and fitness influencers into clean, engaging instructional videos.\n\nWhat I Need:\nEdit and improve the clarity and flow of workout/instructional content\n\nCreate content that's well-suited for YouTube's audience\n\nAdd clean transitions, pacing, and visuals to keep viewers engaged\n\nSkills:\nProficiency in any video editing software\n\nGood understanding of YouTube video style and viewer expectations\n\nStrong sense of timing and storytelling through visuals\n\nYour edits will help reach fitness lovers and make our content both helpful and engaging.",
        "skills": [
            "Editing",
            "Video Editing",
            "Video Production",
            "Video Services",
            "Videography"
        ],
        "budget": "$13\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Nursery Rhymes Video Songs For Preschool Kids #6",
        "description": "I'm looking for someone who is smart and can record some action songs for preschool kids. No previous experience is required. You can use your phone camera to record the videos.\n\nYou only have to act/dance based on the songs we provide. You will get the payments for each video song you record.\n\nIt's just 3-5 minute long videos and it depends on the song.\n\nPlease take a look at the example videos:\n\n============== ============== ==============\n\n============== ============== ==============\n\nNOTE: I will provide you with all the reference song for each video.\nAlso, you must be in SAREE for more professional looks.",
        "skills": [
            "Copy Typing",
            "Customer Support",
            "Data Entry",
            "Virtual Assistant",
            "Word"
        ],
        "budget": "$2 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/mobile-phone/",
        "title": "Instagram Reels Creation for Organic Nation",
        "description": "I am looking for a skilled content creator to produce informative and educational Instagram Reels for my brand, Organic Nation. The primary objective of these videos is to enhance our brand awareness.\n\nKey Responsibilities:\n- Creating Instagram Reels that demonstrate our products and provide a glimpse behind-the-scenes of our operations.\n- Ensuring the content is informative and educational, yet engaging enough to resonate with our audience.\n\nIdeal Skills:\n- Proven experience in creating Instagram content, particularly Reels.\n- Excellent understanding of Instagram's algorithm and trending content styles.\n- Ability to convey information in a clear, engaging and educational manner.\n- Experience with product demonstration videos and behind-the-scenes content.\n\nPlease provide examples of ...",
        "skills": [
            "Facebook Marketing",
            "Instagram",
            "Internet Marketing",
            "Social Media Marketing",
            "Twitter"
        ],
        "budget": "$2067\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "100-Year Finance Brand Website Overhaul",
        "description": "I'm looking for a comprehensive revamp of my finance-related 100 years 100-year-old legacy Brand site, which has been consistently getting admiration. The project involves both a design update and enhancing the site's usability and mobile responsiveness. The ultimate goal is to bring this legacy brand up to modern web standards while also improving its SEO.\n\nKey aspects of the project include:\n- Implementing a fresh, modern design while still respecting the brand's historical significance.\n- Enhancing the site's usability to ensure a seamless user experience.\n- Making the site fully mobile responsive to cater to today's users.\n- Comprehensive SEO improvements, covering both on-page and technical SEO, as well as link building.\n\nIdeal candidates for this project shou...",
        "skills": [
            "Graphic Design",
            "HTML",
            "Internet Marketing",
            "SEO",
            "Website Design"
        ],
        "budget": "$388\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Company Website Development from Scratch",
        "description": "I'm looking for a skilled web developer to create a comprehensive company website from the ground up. The website should be professionally designed and serve as an informative platform about our company and its services. \n\nKey Sections:\n- 20-25 pages\n- high end UX/UI design and graphics/vectors\n- Marketing material template designs \n\nIdeal Skills and Experience:\n- Proficient in web development languages (HTML, CSS, JavaScript, etc.)\n- Experienced in creating business-oriented websites\n- Good understanding of UX/UI design principles\n- Ability to convey complex information in a clear and engaging manner.",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$864\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Modern Minimalist Single Page PHP Website",
        "description": "I'm looking for a Frontend Developer to design a custom, modern and minimalist single page website. The backend is already set up in PHP, so your focus will solely be on the frontend. \n\nKey responsibilities:\n- Create a sleek, user-friendly design that aligns with a modern and minimalist theme.\n- Incorporate text and images provided into the design in a visually appealing way.\n- Follow specific brand guidelines and color schemes that I will provide.\n\nIdeal skills and experience:\n- Proficiency in frontend web technologies (HTML, CSS, JavaScript).\n- Previous experience designing modern minimalist websites.\n- Ability to implement provided brand guidelines accurately.",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design"
        ],
        "budget": "$27\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Modern Minimalist Website UI Design",
        "description": "I'm seeking a UI designer for a modern and minimalist website. The design should be clean, user-friendly, and aesthetically pleasing, following current best practices in UI/UX design.\n\nIdeal candidates should have:\n- Proven experience in website UI design\n- Strong portfolio featuring modern, minimalist designs\n- Proficiency in design tools like Sketch, Figma, or Adobe XD\n- Understanding of responsive design principles\n\nPlease note that a detailed brief of the specific pages will be provided after selection. Your ability to translate these requirements into a sleek, intuitive design will be key to the success of this project.",
        "skills": [
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$55\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Trade Operation Order Management System",
        "description": "Order Management System for Trading\n\nI'm seeking a developer to implement an Order Management System for my international trading company. This system will manage the entire procurement process from product catalog to vendor fulfillment and customs processing. Despite having multiple features, this is a straightforward project with exceptionally clear documentation. I've prepared detailed specifications and HTML examples for all pages, making this an organized and well-defined implementation task that can be completed quickly.\nWhat Makes This Easy\n\nMust be completed within a few days\nComprehensive, clear specifications\nHTML templates for all pages provided\nWell-defined database structure\nStep-by-step implementation instructions\n\nCore Features\n\nRole-based system (Admin, Office, Cu...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$195\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "For making online presence for my finance company",
        "description": "I need a skilled web developer to build an informative website for my company. The site should encompass several key sections: 'About Us', 'Services', 'Contact Us', 'Home', 'Calculators', and 'Book Appointment'.\n\nKey Requirements:\n- Comprehensive understanding of web development\n- Prior experience in creating informational websites\n- Ability to integrate interactive elements like calculators and booking forms\n- Proficiency in ensuring the website is user-friendly and accessible\n\nThe primary objective of this website is to relay important company information to our visitors. Therefore, a knack for presenting information in an engaging and clear manner will be greatly appreciated.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$233\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Complete Wordpress Website Page Conversion",
        "description": "I'm looking for a freelancer who can convert my current WordPress website pages into a new format. The project involves:\n\n- Converting all existing WordPress website pages to a new format.\n- Ensuring the integrity of the content and layout during the conversion process.\n- Retaining the SEO-friendly structure of the original pages.\n\nIdeal skills and experience for the job include:\n\n- Proficiency in WordPress, HTML and CSS.\n- Prior experience in website page conversion.\n- Strong attention to detail.\n- Knowledge of SEO best practices.",
        "skills": [
            "CSS",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$62\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "No-Code Job Auto-Apply Web Platform Creation",
        "description": "Build a No-Code Job Automation Platform (Like LoopCV)\n\nI am looking to build a job automation web platform similar to , but using no-code tools like Bubble, Webflow, , Zapier, and Airtable.\n\nThe platform should allow users to:\n\nSign up/login securely\nUpload and parse resumes\nSet job preferences (roles, keywords, location, etc.)\nAutomatically fetch job listings from platforms like LinkedIn, Indeed, etc.\nAuto-apply or notify users based on matching jobs\nShow a dashboard with application status/history\nSend email notifications\nIntegrate a payment gateway (Stripe/Razorpay) for premium features\n\nI don’t have coding knowledge, so this project must be fully manageable by you for which i will give recurring payments every month for maintenance after the project is ready and fully functional....",
        "skills": [
            "Bubble Developer",
            "HTML",
            "JavaScript",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$14\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "TO ADVISE ME ON MY DRAFED FEATURES  AND SETTING FOR  APP THAT SELLS  GOODS  AND  TRACK DELIVERS TO CLIENTSS",
        "description": "MY APP DRAFT CONTENT\n TIME USER REGISTRATION\n ENTERED_AGENT OR CLIENT\n FACE(POSTED)\n4. SETTING\n NO MOVEMENT4 DRIVERS\n OF LOW SPEED BY DRV(=DRIVER)\n PURCHASE REPORT\n SALES REPORT\n KM TRAVELLED PER DRV\n12.REPORT_DELIVERY  GRADE _POST\n13.REPORT_ DELIVERY _DEPARTURE\n OF SHOP DEPARTURE\n DETAIL _CHEAP SUPPLIER\n DETAIL\n17.CLIENT_GPS_SAVED\n DRIVER LOC N DELIV\n ORDE DRV 2 DELIVERY\n POST_PRODUCT DETAIL\n21.SUPPLIER_VIEW EDIT ALL ITEMS\n22. DRIVER CAN CALL  ASSIGNED CLIENTS ON DELIVERY WITHOUT SEEING THE PHONE NUMBER OF CLIENT\n23. SAVE NEW CLIENT ON APP\n24. REPORT ON DELIVERY DONE BY DRIVERS",
        "skills": [
            "Excel",
            "GPS",
            "Graphic Design",
            "Mobile App Development",
            "Website Design"
        ],
        "budget": "$10"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Customization and Integration of ChatGPT",
        "description": "I am looking for a ChatGPT expert who can assist me in customizing my ChatGPT assistant, specifically focusing on the response structure and integrating it with other services.\n\nKey aspects of the project:\n- Tailoring the response structure: While I have not specified a particular response style, the ability to adapt and customize the response structure to suit different scenarios will be highly beneficial.\n- Integrating with various platforms: The assistant needs to be integrated with CRM systems and E-commerce platforms.\n\nIdeal skills for the job include:\n- Proficiency in AI and ChatGPT customization\n- Experience with CRM and E-commerce platforms\n- Excellent problem-solving skills\n\nPlease note that the response structure does not have a fixed pattern. The ability to provide context-aware...",
        "skills": [
            "ChatGPT AI Integration",
            "ChatGPT Prompt",
            "HTML",
            "MySQL",
            "Website Design"
        ],
        "budget": "$13 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Classic & Professional Redesign of Law Firm Website",
        "description": "I'm seeking a web designer who can update the visual design of my law firm's website to a more classic and professional style. The primary focus will be on:\n\n- Modernizing the website's visual appeal while keeping it classic and professional.\n- Retaining certain elements from the current design, specifically our logo and selected pictures. \n\nThe ideal candidate for this project will have a strong portfolio in creating professional, user-friendly websites, especially for law firms or similar industries. Experience in minimalist design with a focus on usability is highly desirable. The ultimate goal is to enhance our site's visual appeal and consequently, increase client inquiries. Please provide examples of your previous work that align with this brief.",
        "skills": [
            "Graphic Design",
            "PHP",
            "Website Design"
        ],
        "budget": "$137\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Codeigniter 4 - fix crud only (1 page)",
        "description": "Page error issues. Only one page\nWork with ftp only",
        "skills": [
            "Codeigniter",
            "HTML",
            "MySQL",
            "PHP",
            "Website Design"
        ],
        "budget": "$17\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Long-term Collaboration with Web Designer/Developer",
        "description": "I'm in search of a motivated freelance designer (or developer) interested in forming a long-term collaboration. The goal is to work together not only on design and development, but also on finding and handling client projects.\n\nKey Aspects of the Collaboration:\n- Client Communication: I'm comfortable handling this aspect, but I appreciate a partner who can also contribute to it.\n- Design and Development: I seek a partner who can help deliver professional design work.\n- Project Management: While I can manage projects, having a partner who can also contribute to this aspect would be beneficial.\n- Client Base: My typical clients are small businesses. Understanding their needs and expectations will be crucial for our success.\n- Project Focus: My primary focus has been on web design, ...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$124\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Modern Informational/Blog Website Development",
        "description": "I'm looking to hire a skilled website developer to build a brand new, modern and clean, informational/blog business website.\n\nKey Requirements:\n- Fluent English speaker to mitigate language barriers\n- Located in or works on Eastern Standard Time for real-time communication\n- Experience with creating clean, modern design websites\n- Capable of integrating main tabs: Home, Products, Resources, About Us, Contact Us, with sub-category tabs under dropdown menus\n\n\nIdeal skills for the job include web development, UX/UI design, no ecommerce will be required.  Site is mainly an informational selling tool for Commercial Architects & Residential homeowners as a resource in the product offering & product options available. Please provide examples of your previous work that align with thes...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$1982\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Vik Booking Configuration for WordPress Hotel",
        "description": "I need a professional to configure the Vik Booking plugin for my WordPress hotel site. The system should allow room bookings with different prices based on the number of occupants. It must also manage the availability of all hotel rooms correctly to prevent overbookings.\n\nKey Requirements:\nA) Room Creation and Configuration\n- Create and set up all 30 hotel rooms in the system, accurately establishing their rates and availability.\n- Implement a pricing strategy for the Matrimonial rooms, differentiating the cost based on whether the occupancy is 1 or 2 persons.\n- Ensure the system accurately manages the availability of all rooms to prevent overbookings.\n\nB) Payment Method Configuration\n- Set up various payment methods: Credit Card, Bank Transfer (for deposits), and Pay at Hotel.\n\nC) Website...",
        "skills": [
            "HTML",
            "PHP",
            "Plugin",
            "Website Design",
            "WordPress"
        ],
        "budget": "$43\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Affordable Domain & Professional Email Setup",
        "description": "I'm in the process of launching a small local business and I'm in need of an expert to assist me in purchasing a cost-effective .com web domain and setting up a professional email service, preferably with Google Workspace.\n\nKey Requirements:\n- Domain procurement: Identify and purchase a suitable .com domain at a competitive price.\n- Email setup: Configure a professional email service with added features, ideally Google Workspace, to enhance business communications.\n- Budget-friendly approach: Prioritize cost-effective solutions without compromising on quality.\n\nSkills and Experience:\n- Proficiency in domain registration processes and platforms.\n- Experience with setting up Google Workspace or similar professional email services.\n- Strong understanding of cost-effective business s...",
        "skills": [
            "Graphic Design",
            "HTML",
            "Website Design"
        ],
        "budget": "$12\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "AI Video Avatar SaaS Development",
        "description": "I'm looking to build a budget-friendly SaaS platform for AI video avatars. The core functionalities of this platform should include: \n\n- Customizable avatars: Users should be able to make basic changes to the avatars, like color and clothing.\n- Real-time video generation: The platform needs to be capable of generating video in real-time.\n- Avatar voice integration: This feature will allow the avatars to 'speak' in sync with the video.\n\nThe primary target users for this platform will be content creators. Therefore, the platform should be user-friendly and equipped with tools that are appealing and accessible to this demographic. \n\nThe ideal freelancer for this project should have:\n- Proven experience in developing SaaS platforms\n- Expertise in AI and video technology\n- Unders...",
        "skills": [
            "AI (Artificial Intelligence) HW/SW",
            "JavaScript",
            "SaaS",
            "Website Design"
        ],
        "budget": "$7 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Informative Website Development for Small Business",
        "description": "I'm looking to build a simple yet effective website for my small business. The main purpose of this site is to provide information about my company and the services we offer. \n\nKey Features:\n- Comprehensive details about my company and our services\n- Contact form for inquiries\n- Section for customer reviews\n\nIdeal Skills:\n- Proficiency in web development and design\n- Experience with creating business websites\n- Knowledge of implementing interactive elements on a website\n- Excellent understanding of user experience and interface design\n\nYour proposal should include examples of similar projects you've completed. I appreciate a clean, professional design that aligns with my brand and resonates with my target audience.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$1996\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Modern WooCommerce Website Development",
        "description": "I need an experienced web developer to build a modern and clean WooCommerce website for selling physical goods. The website should be user-friendly, responsive, and designed with a modern and clean aesthetic. \n\nKey Features:\n- Integration of product reviews and ratings\n- Comprehensive inventory management system\n\nEssential Skills:\n- Expertise in WooCommerce and WordPress\n- Strong understanding of modern web design principles\n- Experience with integrating product reviews and inventory management systems\n- Knowledge of SEO best practices for eCommerce\n- Excellent communication skills for project updates and discussions. \n\nPlease provide examples of previous WooCommerce sites you have built in your proposal.",
        "skills": [
            "eCommerce",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$3 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Customer Referral System Development -- 2",
        "description": "I'm looking for a professional to create a customer referral system for my business. The system should be centered around the use of referral codes, which customers will use to refer other potential customers. \n\nKey Requirements:\n- Design and implement a robust customer referral system\n- Ensure a seamless integration of referral code system\n- Prior experience in developing referral systems is a plus\n- Knowledge in creating user-friendly interfaces is essential\n\nThough I haven't decided on the specific rewards for the referrals yet, the system should be flexible enough to accommodate various types of incentives, from discounts to cash rewards to loyalty points. Your ability to provide recommendations based on your experience would be greatly appreciated.",
        "skills": [
            "Graphic Design",
            "HTML",
            "Node.js",
            "PHP",
            "Website Design"
        ],
        "budget": "$17\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Modern WordPress Photography & VideoGraphy  Site Design",
        "description": "I'm transitioning from Squarespace to WordPress and need a budget-friendly professional to design a modern photography portfolio site with Elementor. \n\nKey Features:\n- Selection and customization of a suitable WordPress template, with input on design from you.\n- creating a video page \n-mirroring my website also the new template I use \n- Creation of a 'Blog' section.\n- Utilization of my hosting (Hosinger) and domain (Go Daddy).\n\nYou can take a look at my current site () for reference. I appreciate the design of this template\n (), \n\nbut I'm open to your expert suggestions.\n\nSkills & Experience Required:\n- Extensive knowledge of WordPress and Elementor.\n- Prior experience in designing modern, minimalist portfolios, preferably in the photography industry.\n- Ability to i...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$445\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Comprehensive Comparison Site & Blog Design",
        "description": "I'm looking for a talented web designer to create an interactive comparison site and blog that encompasses a variety of elements. \n\nThe site should be able to:\n- Feature product comparison tables\n- Incorporate engaging blog articles\n- Present real estate listings\n- Include guides and infographics\n\nThe ideal candidate should have a strong portfolio in web design, particularly with e-commerce and comparison sites. Experience in creating interactive elements and user-friendly interfaces is a must. Understanding of SEO and ability to design with mobile responsiveness in mind will be highly valued.",
        "skills": [
            "Graphic Design",
            "HTML",
            "SEO",
            "Website Design",
            "WordPress Design"
        ],
        "budget": "$85\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Long-term Graphic & Web Designer Needed",
        "description": "I'm in search of a talented graphic and web mockup designer who can help with various projects, including potentially designing marketing emails. \n\nKey Responsibilities:\n- Creating web mockups\n- Graphic design\n\nDesired Skills:\n- Email marketing knowledge would be a bonus",
        "skills": [
            "Graphic Design",
            "Illustrator",
            "Logo Design",
            "Photoshop",
            "Website Design"
        ],
        "budget": "$14 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "WooCommerce WordPress Site for Physical Products",
        "description": "I'm looking to develop a WooCommerce WordPress website dedicated to selling physical products. The site should be user-friendly, efficient, and capable of handling a wide range of products.\n\nKey Features:\n- Product pages that incorporate product reviews. I want my customers to have the opportunity to share their experiences with the products, creating a sense of community and trust.\n\nIdeal Skills and Experience:\n- Expertise in WooCommerce and WordPress is essential.\n- Previous experience in developing eCommerce sites focused on physical products is highly desirable.\n- Knowledge of implementing and managing product review systems is a plus.\n- Strong understanding of SEO and digital marketing strategies to enhance site visibility would be beneficial.",
        "skills": [
            "eCommerce",
            "PHP",
            "SEO",
            "Website Design",
            "WordPress"
        ],
        "budget": "$31\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Flutter Mobile App Minor Enhancements",
        "description": "I'm looking for a Flutter developer to enhance my mobile app's front end. The project involves adding a few minor features and an interactive tutorial in the form of tooltip hints. These will guide users on how to use the navigation and action buttons. \n\nKey Project Requirements:\n- Implement tooltip hints that trigger on click, guiding users on how to use navigation and action buttons\n- Ensure new features don't impact the current version of the app\n- Work with provided FIGMA designs for all necessary changes\n\nIdeal Candidate:\n- Proven experience in Flutter development\n- Strong understanding of mobile app front end enhancement\n- Ability to implement features without disrupting existing functionality\n- Experience working with FIGMA designs\n- Detail-oriented and able to follow...",
        "skills": [
            "Android",
            "iPhone",
            "JavaScript",
            "Mobile App Development",
            "Website Design"
        ],
        "budget": "$311\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Luxury Fashion Shopify Store Audit",
        "description": "Audit and fix all issues related to seo on page and speed mobile friendly and pictures optimization etc...for a new shopify store including but not limited to : \n\nSitemap\nGoogle cosnole issues and indexing \nGoogle marchant account suspention fix",
        "skills": [
            "eCommerce",
            "HTML",
            "Internet Marketing",
            "SEO",
            "Website Design"
        ],
        "budget": "$26\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Shopify Theme Customization & App Integration",
        "description": "I need a skilled Shopify developer with expertise in theme customisation and app integration. \n\n- Theme Customization: The main task is to customise the homepage layout of our Shopify store. If you have experience with making visually appealing, user-friendly layouts, that would be a plus. Our designer has done a great job of creating designs that fit nicely within the theme, so we won't need extensive work on this. \n- App Integration: In addition to the theme customisation, I need assistance with integrating a couple of apps. Your ability to seamlessly incorporate these tools into our store will be crucial. A customer portal and testimonial slider to name the main one. \n\nIdeal skills for this project include:\n- Proficiency in Shopify and its theme customisation tools\n- Experience wit...",
        "skills": [
            "HTML",
            "Shopify",
            "Shopify Templates",
            "Website Design"
        ],
        "budget": "$646\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Modern Coffee Trailer Website on Squarespace",
        "description": "I'm looking to create a simple yet engaging website for my coffee trailer business on Squarespace. The main purpose of the site is to attract customers to visit the trailer. It should have a simple contact form for online enquiries, and the overall aesthetic needs to be modern and sleek.\n\nKey aspects of the project:\n- Design a clean, modern, and sleek website that reflects the brand of the coffee trailer\n- Implement a simple contact form for online orders\n- Create engaging and informative content about the business and the menu\n\nIdeal candidates should have experience with Squarespace, web design, and creating simple online ordering systems. A portfolio that showcases modern, sleek designs would be highly advantageous.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$278\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Shopify Store Development for Fashion Brand",
        "description": "I'm looking for a seasoned Shopify developer to create a theme and build a store for selling clothing and accessories. The store should be visually appealing, user-friendly, and optimized for conversions.\n\nKey Requirements:\n- Development of a Shopify store tailored for physical products, specifically clothing and accessories.\n- Creation of a unique, brand-aligned Shopify theme.\n- Implementation of specific functionalities including:\n  - Product filter options to enhance user navigation and product discovery.\n  - Customer reviews section for product feedback and social proof.\n  - A Wishlist feature to encourage user engagement and future purchases.\n\nIdeal Skills and Experience:\n- Proven experience in Shopify development and theme building.\n- A strong portfolio showcasing previous work ...",
        "skills": [
            "eCommerce",
            "HTML",
            "Shopify",
            "Shopify Templates",
            "Website Design"
        ],
        "budget": "$20 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Interactive Website Development with E-commerce",
        "description": "I'm looking for a web developer with experience in e-commerce and interactive website features to build a site with the following components:\n\n1. Live Stream: The website should have the capability to embed live content from external sources. The specified platform for this has not been confirmed yet, so flexibility and adaptability will be key.\n\n2. Media Download: There should be a comprehensive library of downloadable files, including PDFs, Videos, and Audio files.\n\n3. Book and Media Store: An online shop needs to be integrated into the site for selling books and other media. The developer will need to set up a system for uploading product details and media items to the product page.\n\n4. Donation: A secure and easy-to-use donation feature should be incorporated into the site.\n\n5. VO...",
        "skills": [
            "eCommerce",
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design"
        ],
        "budget": "$271\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Shopify Theme Development for Electronics Store",
        "description": "I'm looking for an expert Shopify developer to create a new theme for an e-commerce store primarily selling one product and a few ancillary optional items.\n\nThe main  product is the CS Time Clock ( Image attached) The company is Emptrak  (Logo Attached)\nThis device should be featured in the theme.\n\nI do not require page content as this is a theme design project, but these are the pages that my team will add later. \n\nContacts\nTerms and Conditions\nTraining\nPrivacy\nMembers Page\nSupport Page\nBlog\nAffiliate Page",
        "skills": [
            "eCommerce",
            "HTML",
            "Shopify",
            "Shopify Templates",
            "Website Design"
        ],
        "budget": "$124"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Multi-Platform Automated Ads System Development",
        "description": "I'm looking for a seasoned professional with expertise in Meta Marketing API (Facebook, Instagram) and Google Ads API for the creation of an automated ads creation system. This system will be integrated into our SaaS platform, aimed at helping store and restaurant owners with individual and multiple product advertising.\n\nKey Requirements:\n- Proficiency in Meta Marketing API and Google Ads API\nWhatsapp api\n- Experience in developing automated systems\n- Understanding of e-commerce and restaurant advertising needs\n- Knowledge of SaaS platform development\n- Prior experience with multi-platform integration is a plus.\n\nYour role will involve creating a seamless interface that allows our users to automate their ads across these major platforms. The goal is to simplify the advertising process...",
        "skills": [
            "HTML",
            "JavaScript",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$269\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Old WordPress Site Recovery",
        "description": "I'm looking for a skilled web developer with strong WordPress experience to help me recover an old site. I use Holsinger is my old host\n right now my website is  with Squarespace    I need someone who can help me find my old wordpress template \n\nIdeal Skills and Experience:\n- Extensive experience with WordPress\n- Strong web development and design skills\n- Experience in site recreation and content replication\n- Proficient in troubleshooting and problem-solving\n- Excellent attention to detail",
        "skills": [
            "CSS",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$54\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "New Construction Recruitment Company Branding",
        "description": "I'm starting a new construction recruitment company and I need a creative professional to help me with naming and branding. \n\nKey Responsibilities:\n- Develop a catchy, relevant business name\n- Design a unique logo that embodies the spirit of construction recruitment\n\nIdeal Candidates:\n- Proven experience in branding and logo design, preferably for a recruitment or construction-related company\n- Excellent creative and conceptual thinking skills\n- Strong understanding of the construction industry\n- Portfolio of successful brand development projects",
        "skills": [
            "Corporate Identity",
            "Graphic Design",
            "Logo Design",
            "Photoshop",
            "Website Design"
        ],
        "budget": "$2166\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Kayak Group Website Development",
        "description": "I'm looking for a low-cost basic multi-page website for our kayak group. The site should serve multiple purposes: \n\n- Providing basic information about our group\n- Facilitating sign-ups for our kayaking events and new memberships\n- Offering a space for sharing photos and posts.\n\nKey sections of the website will include 'About Us', 'Join Group', and a space for member posts and photo storage. \n\nThe ideal freelancer should have experience in web development, particularly in creating multi-page websites with structured information. Familiarity with photo storage solutions and member interaction spaces will be a plus. I am looking for a clean, user-friendly design that can cater to our group's needs on a modest budget as this is a free membership group. I already ...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design",
            "WordPress"
        ],
        "budget": "$456\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Need a google doc made, example attached",
        "description": "I am looking for a skilled and reasonable website designer who can create a google doc for me like the same in this as example attahced.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$10\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Online Stripe Payment Terminal Integration",
        "description": "I need a skilled professional to integrate an online Stripe payment terminal into my website. \n\nIdeal Skills:\n- Extensive experience with Stripe API\n- Proficient in integrating online payment systems\n- Knowledge in e-commerce and payment security\n\nPlease note, the specific platform of my website has not been disclosed yet, but it's crucial that you should be adaptable to various platforms. I'm also open to suggestions on specific features that could enhance the payment experience, such as multi-currency support or one-click payments. Your expertise in this field will be highly valued.",
        "skills": [
            "eCommerce",
            "HTML",
            "PHP",
            "Stripe",
            "Website Design"
        ],
        "budget": "$28\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "No-Code AI Caption Tool Creation",
        "description": "I'm looking for a no-code specialist or frontend developer to help me create a branded AI caption generator for my Carrd website. This tool will take in user input and connect to the OpenAI API to generate and display five captions.\n\nKey Requirements:\n• User Input: The tool should accept a text description from the user.\n• API Integration: It needs to connect to the OpenAI API to generate the captions.\n• Display: The tool should display the five generated captions in a playful design style, all on the same page.\n• Responsiveness: The site must be clean and responsive, working seamlessly across all devices.\n• Branding: The tool should reflect my brand, using my logo, color scheme, and custom fonts.\n• Optional: Some light backend logic using Zapier could be...",
        "skills": [
            "CSS",
            "Graphic Design",
            "HTML",
            "PHP",
            "Website Design"
        ],
        "budget": "$126\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Children's Interactive Game Development with WebGL",
        "description": "I'm looking for a skilled WebGL developer to help create an interactive game aimed at children. The game will be browser-based, designed to be engaging and entertaining for a young audience.\n\nKey Responsibilities:\n- Design and develop a 3D interactive game using WebGL\n- Ensure the game is exclusively web-compatible\n- Create child-friendly content and interfaces\n\nSkills and Experience Required:\n- Proven experience in WebGL, particularly in game development\n- Strong understanding of child-friendly design principles\n- Excellent skills in creating engaging, interactive content\n- Experience in developing web-only games",
        "skills": [
            "Article Writing",
            "Data Entry",
            "Mobile App Development",
            "Website Design"
        ],
        "budget": "$11 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Content-Based Startup Needs Website & App",
        "description": "I'm in the process of launching a content-focused startup and require a professional who can develop a user-friendly, engaging website and app for this venture. \n\nKey requirements:\n- Expertise in web and app development\n- Experience in creating content-based platforms\n- Ability to design intuitive, user-friendly interfaces\n- Knowledge of SEO and digital marketing tools\n- Understanding of content management systems\n\nYour role will be crucial in establishing our online presence and making our content accessible to a wider audience. Please include examples of similar projects you've completed in your proposal.",
        "skills": [
            "Graphic Design",
            "PHP",
            "React Native",
            "React.js",
            "Website Design"
        ],
        "budget": "$19\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Comprehensive Finance Application Development",
        "description": "I'm looking for a seasoned developer/team to create a robust finance application that encompasses both front-end and back-end development. The application should incorporate the following key functionalities:\n- Expense tracking\n- Budget planning\n- Investment management\n- Instant Loan processing\n\nThe application should cater to three distinct user roles:\n- Administrator\n- User\n- Financial Advisor\n\nWith regards to platform compatibility, the finance application needs to be accessible on:\n- Web\n- iOS\n- Android\n\nIdeal skills for this job include proficient knowledge in full-stack development, finance-related application experience, and cross-platform compatibility. Previous experience in developing applications with similar functionalities will be highly advantageous.",
        "skills": [
            "Android",
            "iPhone",
            "Mobile App Development",
            "PHP",
            "Website Design"
        ],
        "budget": "$103\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "E-commerce Website Design & Development",
        "description": "I'm looking for a professional with a strong background in e-commerce website design and creation. The aim is to build a site for selling physical products. \n\nKey Requirements:\n- Home Page\n-Landing Page\n- Product Page\n\nIdeal Skills:\n- Proficiency in e-commerce platforms (Shopify)\n- Experience with Replo\n- Strong web design and development skills\n- Experience with UX/UI design principles\n- Knowledge of SEO best practices\n\nPlease provide your portfolio with examples of previous e-commerce sites you have designed and developed.",
        "skills": [
            "eCommerce",
            "Graphic Design",
            "HTML",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$717\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "UX-Focused Website Redesign on Figma",
        "description": "I am looking for an experienced web designer to redesign my website on Figma with a primary focus on improving user experience. The target audience for this site is general consumers, so the design should be appealing to a wide variety of users.\n\nKey requirements include:\n- Expertise in Figma and web design\n- A strong understanding of user experience principles\n- Ability to create a visually appealing design\n\nParticularly, I need the navigation of the site to be simple and intuitive, making it easy for users to find what they need. Quick load times and accessibility are also important, but the simplicity of navigation is my top priority.\n\nPlease provide examples of previous work that demonstrate your ability to improve user experience through thoughtful web design.",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$44\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "React website changes",
        "description": "Website Redesign & SEO Brief – \n\n? Objective:\n\nCreate a clean, modern, high-converting version of  that:\n\nLooks professional and trustworthy\n\nDrives more leads/bookings\n\nIs optimized for on-site and off-site SEO\n\nSupports long-term growth (blog, location pages, SEO content)\n\n✅ Core Features to Include\n\n? 1. Modern Website Redesign\n\nClean, minimal, mobile-first layout\n\nSoft shadows, rounded cards, trust-focused visuals\n\nEasy-to-use booking form\n\nHigh-quality, custom or branded images (we’ll provide samples)\n\n? 2. Enhanced Booking Section\n\nSimplified booking flow or multi-step form\n\nClear steps: Property type → Address → Contact info\n\nOptional file upload (BER docs/photos)\n\nInstant confirmation message + email (Mailchimp/MailerLite)\n\n? 3. Blog Section (SEO-Driven)\n\n...",
        "skills": [
            "Graphic Design",
            "HTML",
            "PHP",
            "SEO",
            "Website Design"
        ],
        "budget": "$179\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "AI-Driven Sports Betting Website Creation",
        "description": "Project Scope & Requirements\n\nFIGMA - \n\nDesign & Development\n\t•\tFollow the attached Figma mockup precisely (mobile and desktop versions).\n\t•\tFully responsive design for all screen sizes.\n\t•\tCustom-built solution – do not use WordPress.\n\nAI-Generated Content\n\t•\tNews Section: Automated AI-generated news articles.\n\t•\tFootball & Horse Racing Tips: AI-generated betting tips.\n\t•\tAbility to edit, remove, or pin AI-generated content manually.\n\nSEO Optimization & Tracking\n\t•\tTrack link clicks of “Claim” buttons.\n\t•\tClean code and structure for effective search engine indexing.\n\t•\tFast loading speeds and mobile-friendly performance.\n\t•\tSEO-friendly URLs and customizable metadata.\n\nBackend CMS (Custom or Proprietary)\n...",
        "skills": [
            "HTML",
            "PHP",
            "Website Design"
        ],
        "budget": "$467\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Gmail Mobile Stacking Issue Fix",
        "description": "I'm facing a display issue in our newsletter sent via a CRM email campaign builder. While the second row with alternating images and text stacks correctly when I toggle the \"reverse stack\" option, the first row does not stack as expected in Gmail mobile.\n\nAbout the project:\n- The first row of the email contains images and text arranged side by side.\n- I've tried making CSS adjustments to the first row but the problem persists.\n\nI need assistance with ensuring that both rows stack properly on Gmail mobile, with the second row reverse-stacked as desired, while the first row should also stack responsively. The stacking issue only occurs in Gmail mobile; Apple Mail on mobile displays the layout correctly. We have access to the full code and are able to make edits. \n\nIdeal s...",
        "skills": [
            "CSS",
            "HTML",
            "Mailchimp",
            "PHP",
            "Website Design"
        ],
        "budget": "$17\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Simple WordPress Retail Site Creation",
        "description": "I'm looking for a web developer to build a basic WordPress site for my retail business using a template that I will provide. The site needs to promote my business and include the following pages:\n\n- Home: The main landing page.\n- About Us: A page detailing our story, mission, and values.\n- Contact Us: A page with our contact information and a form for inquiries.\n- Gallery: A page showcasing our products and store.\n\nIdeal skills and experience for this project include:\n\n- Proficiency in WordPress\n- Experience with e-commerce and retail website development\n- Ability to work with and customize WordPress templates\n- Good understanding of UX/UI design principles\n- Basic SEO knowledge to optimize the site for search engines.\n\nMust also have the ability to keep current SEO rank.",
        "skills": [
            "Graphic Design",
            "HTML",
            "SEO",
            "Website Design",
            "WordPress"
        ],
        "budget": "$159\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Redesign a website",
        "description": "Website Redesign for AgriFood Startup | WordPress + Shopify Integration \n\nWe’re a small but growing startup, with a basic current landing page. Now, we're ready to level up.\n\nWe’re looking for a freelance web designer/developer to help us redesign our website using preferably WordPress, while keeping Shopify plugin integration for online sales.\n\n? What You’ll Work On:\n\n    Turning our existing site (landing page) into a website\n\n    Ensuring Shopify plugin is properly integrated and functional\n\n    Optimizing for clear UX and mobile responsiveness\n\n✅ What We Have:\n\n    Logo and visual guidelines\n\n    Product visuals and English text\n\n    Shopify plugin\n\n    Domain name\n\n?‍? Who We're Looking For:\n\n    Japanese native speaker \n\n    Decent English communicatio...",
        "skills": [
            "English Translation",
            "HTML",
            "Shopify",
            "Website Design",
            "WordPress"
        ],
        "budget": "$483\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Shopify Designer Partner for E-commerce Venture",
        "description": "I'm an e-commerce marketer seeking a Shopify designer to collaborate on online store projects. The role involves store design and setup, with profit-sharing rather than upfront payment. \n\nRequirements:\n- Intermediate experience in Shopify design and modification\n- Speedy execution\n- Detail-oriented, with a focus on enhancing user experience\n- Willingness to share profits based on a clear agreement\n\nI will handle marketing, advertising, and customer acquisition, while you will be responsible for store design and preparation for sale. \n\nPlease note:\n- I am targeting the American market \n- A portfolio showcasing bold and colorful designs is preferred \n\nIf you are interested, please send me your work for discussion.",
        "skills": [
            "Shopify",
            "Website Design"
        ],
        "budget": "$955\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/website-design/",
        "title": "Engaging Animated Pharma Landing Page Design - Require Prototype Design before Implementing",
        "description": "I'm seeking a skilled web designer and animator to create an interactive and engaging landing page for a pharmaceutical consulting services website. The design should incorporate dynamic, attention-grabbing animation effects, with smooth, clean transitions. \n\nKey Responsibilities:\n- Design an animated, illustration-based landing page prototype with interactive elements.\n- Implement hover effects, scrolling animations, and clickable buttons.\n- Optimize the landing page for desktop, tablet, and mobile devices.\n\nScript and Storyboard:\n- The landing page will start with an introduction to the pharmaceutical subject matter.\n- It will feature animated illustrations highlighting key product benefits.\n- It will conclude with a strong, clear call to action.\n\nIdeal Skills and Experience:\n- Prov...",
        "skills": [
            "Graphic Design",
            "HTML5",
            "JavaScript",
            "User Interface / IA",
            "Website Design"
        ],
        "budget": "$139\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "No-Code Job Auto-Apply Web Platform Creation",
        "description": "Build a No-Code Job Automation Platform (Like LoopCV)\n\nI am looking to build a job automation web platform similar to , but using no-code tools like Bubble, Webflow, , Zapier, and Airtable.\n\nThe platform should allow users to:\n\nSign up/login securely\nUpload and parse resumes\nSet job preferences (roles, keywords, location, etc.)\nAutomatically fetch job listings from platforms like LinkedIn, Indeed, etc.\nAuto-apply or notify users based on matching jobs\nShow a dashboard with application status/history\nSend email notifications\nIntegrate a payment gateway (Stripe/Razorpay) for premium features\n\nI don’t have coding knowledge, so this project must be fully manageable by you for which i will give recurring payments every month for maintenance after the project is ready and fully functional....",
        "skills": [
            "Bubble Developer",
            "HTML",
            "JavaScript",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$14\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Google Sheets Customer Order Page",
        "description": "I'm in need of a specialized Google Sheets customer order page. This page should be able to capture order details like item and quantity. \n\nKey Features:\n- Collecting order details: The page should be able to capture the item description, the quantity ordered, and the price per item.\n\nIdeal Skills:\n- Proficiency in Google Sheets\n- Experience in creating custom order tracking systems\n- Ability to incorporate order details into a spreadsheet\nAutomation things like a clear sheet button and a submit button. As well as back in features like inventory from a master inventory sheet of only what is currently in stock.\n.",
        "skills": [
            "Data Entry",
            "Google Sheets",
            "JavaScript",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$59 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Help to Win Online Voting Poll",
        "description": "Looking for assistance in winning an online voting poll",
        "skills": [
            "HTML",
            "JavaScript",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$480\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Private project or contest #39297574",
        "description": "Please Sign Up or Login to see details.",
        "skills": [
            "Blockchain",
            "Node.js",
            "Python",
            "Software Architecture",
            "Solana",
            "Telegram API",
            "Web3.js"
        ],
        "budget": "N/A"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "FTP Log Monitoring & Failed Upload Tracking",
        "description": "We have been sending files using FTP windows API to Godaddy servers for past 10 years and recently we are unable to upload files.  I need to see where the file is being blocked from.   I just a trace log so I can provide it to Godaddy tech support so they can see where the is on their server.   \n\nProject is to crate a log that traces the FTP background API windows file transfer so I can present to Godaddy tech support.  It's a one time log I don't need anything fancy and you could just instruct me on a tool to use to capture the FTP communication.",
        "skills": [
            "Software Architecture",
            "Software Engineering"
        ],
        "budget": "$140\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Telegram Shop",
        "description": "I am looking for a skilled freelancer for my business that will facilitate the purchase of digital products. Here are the key features I need:\n\nUser Account Balance: Customers should be able to create accounts and add money to their balance using cryptocurrency or Cash App.\n\nOrder Management: Once customers have sufficient balance, they should be able to place orders for digital items.\n\nNotifications: I would like to receive notifications whenever a customer places an order so I can promptly deliver their purchases.\n\nUser-Friendly Interface: The bot should be easy to use, guiding customers through the purchase process seamlessly.",
        "skills": [
            "Android",
            "iPhone",
            "Mobile App Development",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$435\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Thinkscript to TrendSpider Indicator Conversion",
        "description": "I'm looking for a seasoned programmer who can convert a Thinkscript Indicator to TrendSpider. The goal is to enhance the indicator's performance and reduce lag. \n\nUltimately, I need someone who is proficient in JavaScript, familiar with TrendSpider's unique syntax, and has prior experience with such conversions. This is not a project for beginners or those unfamiliar with Thinkscript and TrendSpider. \n\nKey Requirements:\n- Proficient in JavaScript\n- Familiar with TrendSpider's unique syntax\n- Prior experience converting Thinkscript to TrendSpider\n- Ability to enhance performance and reduce lag\n\nI'll provide access to both the Thinkorswim platform and TrendSpider. Please only bid if you have relevant experience. Time wastage will not be entertained. Thank you.",
        "skills": [
            "C++ Programming",
            "JavaScript",
            "Mathematics",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$51\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Chrome Extension for Multilingual Video Call Transcription",
        "description": "I'm looking for a developer who can create a Chrome extension that transcribes video conference discussions in real-time over Zoom, Microsoft Teams, Google Meet etc.\n\nKey Features:\n- Supports major platforms: Zoom, Microsoft Teams, and Google Meet\n- Provides both live and post-call transcription\n- Displays transcriptions as an overlay on the video call\n- Transcribes discussions in over 100 languages\n- Include payment gateway like PayPal or Stripe\n\nIdeal Skills and Experience:\n- Proficient in Chrome extension development\n- Previous experience with real-time transcription software\n- Understanding of video conferencing APIs\n- Multilingual capabilities or experience with multilingual software\n- Knowledge of user-friendly interface design",
        "skills": [
            "Extensions & Additions",
            "Google Chrome",
            "JavaScript",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$454\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Multi-Platform Automated Ads System Development",
        "description": "I'm looking for a seasoned professional with expertise in Meta Marketing API (Facebook, Instagram) and Google Ads API for the creation of an automated ads creation system. This system will be integrated into our SaaS platform, aimed at helping store and restaurant owners with individual and multiple product advertising.\n\nKey Requirements:\n- Proficiency in Meta Marketing API and Google Ads API\nWhatsapp api\n- Experience in developing automated systems\n- Understanding of e-commerce and restaurant advertising needs\n- Knowledge of SaaS platform development\n- Prior experience with multi-platform integration is a plus.\n\nYour role will involve creating a seamless interface that allows our users to automate their ads across these major platforms. The goal is to simplify the advertising process...",
        "skills": [
            "HTML",
            "JavaScript",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$269\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Build n8n AI Agent Using with Telegram",
        "description": "AI Agent Development Using n8n with Telegram Integration\nProject Overview\nI have my own OpenAI API and Telegram Token and Chat ID ready, I need to set up a simple but effective AI Agent using n8n that can answer my questions based on the information I provide. The AI will use a Retrieval-Augmented Generation (RAG) system, meaning it will refer to my stored data before generating responses. I also want it to be accessible via Telegram, so I can easily send information and get answers.\n\nSample Video Tutorial: \n\nKey Requirements\nAI Agent with RAG System\n\nThe AI should answer questions based on my stored data.\nI need a way to manually add and update information so the AI keeps improving.\nSimple Information Database\n\nA basic storage system where I can key in and manage my own information.\nShoul...",
        "skills": [
            "Python",
            "Software Architecture"
        ],
        "budget": "$128\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "WebGL Expert Needed for Educational 3D Animation",
        "description": "I'm seeking a skilled WebGL professional to help with a project focused on creating 3D animations for teaching scientific concepts. \n\nKey Aspects:\n- The animation will be aimed at educational content, specifically to illustrate various scientific ideas and principles.\n- The project is inherently interactive, requiring a deep understanding of WebGL and its capabilities for creating engaging, immersive experiences. \n- Creativity and problem-solving skills will be key in translating complex concepts into intuitive, accessible animations.\n- Experience with 3D animation and a passion for science education will set you apart.\n\nYour role will involve collaborating with me to design and implement these animations, ensuring they are both pedagogically sound and visually appealing. A portfolio ...",
        "skills": [
            "Animation",
            "Engineering",
            "Game Design",
            "Software Architecture",
            "Software Testing"
        ],
        "budget": "$50 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Linux Bootable test/config report script",
        "description": "I need you to develop some software for me. I would like this software to be developed for Linux. What i am looking for a is a program that can be booted and ran on a usb drive. I need the script/program to plug amd play. \n\nWhat i am looking for this to do is to get me a full and complete test report on the computer/ laptop for apple and for windows/ other OS based systems. Also would like it to run complete /full test of all components of the device. I would like a test and configuration report of all results.",
        "skills": [
            "Linux",
            "Software Architecture"
        ],
        "budget": "$131\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "White Hat Hacker Needed to Restore Teramind Monitoring Connection",
        "description": "We are seeking a skilled white hat hacker or cybersecurity professional to help us re-establish a lost remote connection with a monitored computer running Teramind.\n\nThe computer was part of a remote monitoring setup for a webcam modeling business. Communication was lost after the employee installed RAV Endpoint Antivirus, which disrupted Teramind’s connectivity. As a result, we’ve experienced financial losses due to the inability to monitor from abroad.\n\nYour Task:\n\nDiagnose and resolve the issue causing the Teramind software to lose connection.\n\nBypass or safely configure the antivirus (RAV Endpoint) to allow proper functioning of Teramind.\n\nEnsure monitoring is fully restored without compromising the system’s integrity.\n\nProvide recommendations to avoid this issue in t...",
        "skills": [
            "Computer Security",
            "Internet Security",
            "Linux",
            "Software Architecture",
            "Web Security"
        ],
        "budget": "$156\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "E-commerce Data Scraper Application Development",
        "description": "I'm looking to hire a skilled developer to create an application that queries an e-commerce site on an hourly basis. The application should specifically gather and report contact data of interest to us. \n\nKey Features:\n- The application must be able to scrape data from an e-commerce site.\n- It should collect contact data from the site.\n- The data collection should occur every hour.\n\nIdeal Skills:\n- Proficiency in web scraping techniques and tools.\n- Experience in developing applications for e-commerce sites.\n- Ability to implement software that can perform tasks on a scheduled basis.",
        "skills": [
            "C# Programming",
            "Java",
            "PHP",
            "Software Architecture",
            "Web Scraping"
        ],
        "budget": "$428\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Debug and Enhance n8n AI Research Agent",
        "description": "Project Overview:\nI have built a Research AI Agent in n8n. I’m looking for an experienced n8n + API automation expert who can jump in, debug my current setup, and help get a working version running on my local machine via remote access (Zoom or AnyDesk).\n\n________________________________________\n? Project Objectives:\n1.\tReview my Install video to understand the AI Agent and the n8n API configuration.\n2.\tDebug and Fix My Local n8n Setup\no\tI’ve previously built the first version, but it's not working as expected.\no\tYour first task is to connect remotely to my computer, review logs, troubleshoot, and get the n8n environment running cleanly.\n3.\tTest a Sample Deep Research Workflow\no\tThe goal: an n8n agent that accepts input info and outputs research reports in a PDF.\n_________...",
        "skills": [
            "Java",
            "Software Architecture"
        ],
        "budget": "$80\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "MERN Stack Developer for SAAS App",
        "description": "I'm looking for a proficient web developer who is well-versed with the MERN tech stack to help build a SAAS app. The core functionality of the app involves integrating various social media APIs.\n\nKey Requirements:\n- Expertise in the MERN tech stack\n- Experience in building SAAS applications\n- Proficiency in integrating social media APIs, particularly from Facebook, Twitter/X, Instagram, and LinkedIn\n- Capacity to implement user authentication and subscription management features\n- Skills to incorporate an analytics dashboard\n\nThe ideal candidate should have a strong background in web development, with specific experience in creating and managing SAAS applications. A deep understanding and prior experience with the mentioned social media platforms and their APIs will be highly benefici...",
        "skills": [
            "JavaScript",
            "MERN",
            "MERN Stack",
            "Software Architecture"
        ],
        "budget": "$53 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Python Developer - Full Time E-commerce Focus",
        "description": "I'm seeking a Python developer to help with data analysis specific to customer behavior and support the development of an e-commerce web application.\n\nKey Responsibilities:\n- Analyze customer behavior data to inform business decisions.\n- Assist with the development of an e-commerce site.\n- Implement automation scripts to streamline data analysis.\n\nIdeal Skills:\n- Proficient in Python, with strong experience in data analysis.\n- Familiarity with e-commerce platforms.\n- Proven ability to create effective automation scripts.\n\nThis is an immediate, full-time position. Please only apply if you are ready to start right away.",
        "skills": [
            "Django",
            "JavaScript",
            "PHP",
            "Python",
            "Software Architecture"
        ],
        "budget": "$11 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Call Center Software Development",
        "description": "We are launching a call center business based in Khartoum, Sudan, aimed at providing technical support services to various companies—initially targeting sectors like ride-hailing and transportation (e.g., Uber-style services), as well as other businesses in need of reliable phone-based support.\n\nWe are seeking experienced software developers or companies to design and deliver a specialized call center software tailored for Windows OS only.\n\n? Key Software Requirements:\nThe software must support voice calls only (no live chat or email features required).\n\nIt should be optimized for technical support operations.\n\nCapable of managing at least 70 agents from the first year.\n\nShould include a professional reporting system for performance metrics and analytics. These reports will be provid...",
        "skills": [
            "C++ Programming",
            "Java",
            "PHP",
            "Software Architecture",
            "Software Testing"
        ],
        "budget": "$648\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "AI Code Integration into Python Web App",
        "description": "I need assistance in refining and deploying a web app tool I've started developing with AI-generated Python code. \n\nFeatures to implement include:\n- User Authentication: Ensuring secure and personalized user access.\n- Data Visualization: Translating complex data sets into understandable visual formats.\n- API Integration: Enabling the app to communicate with other software and platforms.\n\nIdeal Skills:\n- Proficiency in Python\n- Experience with web application development\n- Familiarity with implementing user authentication systems\n- Competence in data visualization techniques\n- Knowledge of API integration\n\nYour role will involve reviewing my AI-generated code, enhancing its functionality, and ultimately creating a fully operational web app. Please provide a portfolio of your previous w...",
        "skills": [
            "Django",
            "JavaScript",
            "PHP",
            "Python",
            "Software Architecture"
        ],
        "budget": "$1100\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Cryptocurrency Trading AI Bot Development",
        "description": "I need a specialist in AI and trading algorithms to develop a bot for me. The bot will be used for swing trading on cryptocurrency exchanges, specifically Binance and Kraken. \n\nKey Requirements:\n- Proficiency in AI and algorithm development.\n- Experience in cryptocurrency and swing trading.\n- Familiarity with Binance and Kraken APIs.\n\nThe bot should be capable of:\n- Executing swing trading strategies effectively.\n- Integrating seamlessly with both Binance and Kraken.\n- Adapting to market changes in real time.\n\nPlease include past relevant projects in your proposal.",
        "skills": [
            "C Programming",
            "C++ Programming",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$3095\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Java Full-Stack AWS Dev for Charity Legal App",
        "description": "?️ Full Stack Developer (React + Java + AWS) Needed to Finalize Demo for Legal App\n\nDescription:\nI'm developing a website that assists U.S. charities with legal filings — including board communications, voting records, and disclosures. The core functionality is mostly built, but the project needs professional streamlining to get it ready for a clean, working demo.\n\nThere are no active users and no critical data, so you're free to refactor and deploy without risk.\n\nPhase 1 Tasks (Trial Phase):\nThis first engagement will test for a smooth working relationship. If successful, there is opportunity for significant follow-on work.\n\n✅ Deploy existing demo to AWS, with GitHub Actions for automated updates\n✅ Implement basic email integration (e.g., SendGrid)\n✅ Set up user authentica...",
        "skills": [
            "Amazon Web Services",
            "Java",
            "React.js",
            "RESTful",
            "Software Architecture"
        ],
        "budget": "$2571\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Real-Time Location Tracking on Android",
        "description": "I'm seeking a developer who can create a system for tracking an Android phone's location in real-time. The main purpose is personal security. \n\nThe ideal candidate should have:\n- Extensive experience in Android development.\n- Knowledge of GPS tracking systems.\n- Understanding of security protocol implementation.\n- Ability to create user-friendly interfaces. \n\nThis project involves creating an app that allows for real-time tracking. It must be reliable, secure, and easy to use. Your expertise will be key in ensuring the safety of the individual being monitored.",
        "skills": [
            "Android",
            "Java",
            "Mobile App Development",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$227\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "E-commerce Image Automation With AI",
        "description": "Project Title: AI-Powered E-Commerce Image Workflow Automation\nDescription: We are seeking a skilled freelancer to streamline our e-commerce photography process using AI tools and cloud-based solutions. The project involves:\n1.\tResizing images: Automate the resizing of product images for various marketplaces and social media platforms.\n2.\tTagging and indexing: Use AI to generate relevant tags and organize metadata for the images.\n3.\tCloud integration: Store processed images in a searchable, well-organized cloud library (e.g., Google Drive, Dropbox, Amazon S3).\n4.\tAutomation setup: Implement workflow automation using platforms like Zapier or Make to connect resizing, tagging, and storage processes.\nSkills Required:\n•\tExperience with e-commerce image processing.\n•\tProficiency with ...",
        "skills": [
            "Java",
            "JavaScript",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$1727\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Software Technical Audit (Web Application)",
        "description": "Looking for a Software Consultant for Technical Audit (Java Application)\nWe’re looking for an experienced software consultant to conduct a technical audit of a Java-based web application, in preparation for a potential sale.\n\n?️ About the Software:\nA meeting room booking system\n\nLive and used for 6 years, maintained by a small dev team (2 people)\n\nBackend in Java, with a relational database\n\nActive development resumed about a year ago\n\n? Audit Goals:\nAssess overall code quality, structure, and maintainability\n\nIdentify potential technical risks, security issues, or scalability concerns\n\nDeliver a clear technical report to support due diligence in a sale process\n\n? Details:\nRemote project (ideally someone based in Portugal or fluent in Portuguese)\n\nOccasional e-meetings via Google Mee...",
        "skills": [
            "Amazon Web Services",
            "Angular",
            "Java",
            "PostgreSQL",
            "Software Architecture"
        ],
        "budget": "$2523\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Sui Blockchain API Data Extraction & CSV Formatting",
        "description": "I'm looking for a freelancer who can help me access the Sui Blockchain API and download transaction history from a specified public address. \n\nKey requirements:\n- Access to Sui Blockchain API (you will need to get access, I do not have it)\n- Downloading transaction history from a public address\n- Formatting this data into a supplied CSV\n\nThe specific data points to be included in the transaction history are:\n- Transaction ID\n- Timestamp\n- Amount\n- Coins Swapped\n- Type of transaction\n- Balance changes\n\n\nTimestamp (UTC)\tType\tBase Currency\tBase Amount\tQuote Currency (Optional)\tQuote Amount (Optional)\tFee Currency (Optional)\tFee Amount (Optional)\n\nIdeal skills for this job would include experience with blockchain data extraction, proficiency in CSV formatting, and a good understanding of ...",
        "skills": [
            "Excel",
            "Rust",
            "Software Architecture",
            "Web Scraping"
        ],
        "budget": "$25\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "USSD/Web App Developer Needed",
        "description": "I'm looking for a skilled developer experienced in building both USSD and web applications, with a focus on transaction processing. \n\nKey Requirements:\n- Expertise in USSD and web application development.\n- Strong understanding of transaction processing systems.\n- Experience with implementing phone number-based authentication systems.\n\nThe primary function of the application will be to handle transaction processing, so experience in this area is crucial. The app should utilize phone number authentication for user login, so prior experience with this method is preferred. Please provide examples of similar projects you've worked on in your proposal.",
        "skills": [
            "MySQL",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$1281\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Discord Bot for Project Zomboid Server Management",
        "description": "I'm in need of a Discord bot that will assist in managing my Project Zomboid dedicated server. This bot should handle various administrative tasks and integrate with game commands. \n\nKey Features:\n- **Admin Game Commands**: The bot should be able to execute admin game commands.\n- **User Management**: It should help in managing users, like adding/removing or muting players.\n- **Server Settings Management**: The bot needs to adjust server settings as needed.\n- **Monitoring Server Status**: It should constantly monitor the server status and alert for any issues.\n- **Auto Restart**: The bot should be capable of restarting the server automatically when required.\n- **Workshop Mod Detecting and Restart**: It should also detect any workshop mods and restart the server if necessary.\n\nIdeal Ski...",
        "skills": [
            "Bot Development",
            "Discord",
            "Engineering",
            "Software Architecture"
        ],
        "budget": "$155\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Android App for Account & Inventory Management",
        "description": "I'm looking for a skilled mobile app developer to create an Android app for my agents. This app will need to manage accounts for sale, track inventory, and handle payment related services. The app will feature different user roles, specifically Admin and Agent, but not Customer.\n*****All Data transfer within second for Admin panel by agent entry*****\nCore Functionalities:\n- Account Management: The app should allow agents to handle accounts seamlessly.\n- Inventory Management: It should track and manage inventory in real-time.\n- Payment Processing: The app needs a secure and efficient payment processing system.\n\nIdeal Skills:\n- Android App Development: The app is to be exclusively on the Android platform.\n- User Role Implementation: Experience in creating apps with specific user roles i...",
        "skills": [
            "Android",
            "Mobile App Development",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$271\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "write python script to create experiences from chatgpt",
        "description": "Take an input chatgpt query to create experiences for different cities\n\nExample chatgpt query\ncreate a list of 20 experiences in san diego california that you can book an attractive woman to do with you . foreach experience include a title, description, cost in usd, duration in hours and starting time. the description must be at least 100 words. write the output in a csv\n\nFor each row in the output use duckduckgo to fetch images, api provided\ncall an api to get the compressed image url for the image, api provided for compression\ninsert each row into a csv and also a sql table\n\ncreate a list of 5 biggest cities in japan\ncreate a list for 20 biggest cities in usa\n\n\nMore details:\n\nIs this project for business or personal use? Personal\nWhat information should successful freelancers include in ...",
        "skills": [
            "Data Mining",
            "MySQL",
            "Python",
            "Software Architecture",
            "Web Scraping"
        ],
        "budget": "$72\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Odoo API Integration in C#",
        "description": "? Goal\nDevelop a reliable, bidirectional integration module for Odoo that enables:\n1. Reading shipping statuses (including tracking numbers) from Odoo.\n2. Writing orders into Odoo from the middleware.\n3. Reading and updating product prices and stock levels.\n4. Full communication via the official Odoo JSON-RPC API.\n5. User control through a graphical interface (GUI).\n? Architectural Guidelines\n- The module is named `OdooConnector`.\n- It does NOT inherit from `MarketplaceConnector` (independent logic).\n- Communication is strictly via Odoo’s JSON-RPC API (no direct DB access).\n- Standard DTOs are used: ProductDto, OrderDto, ShippingStatusDto.\n- Internal helper classes (OdooApiClient, models) are allowed.\n- All processes must be fault-tolerant and log-friendly.\n? Data Flow & API Usag...",
        "skills": [
            "C Programming",
            "C++ Programming",
            "ERP",
            "Python",
            "Software Architecture"
        ],
        "budget": "$587\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Windows Service for PostgreSQL Data Sync",
        "description": "? Goal\nDevelop the central component of the middleware application consisting of:\n1. A Windows Service that handles automatic synchronization tasks.\n2. A centralized PostgreSQL data access layer for storing products, orders, logs, etc.\n3. A modern graphical user interface (GUI) for managing product and order data manually.\n? Architectural Overview\n- Windows Service: executes sync tasks in the background\n- Database Handler: unified access class for PostgreSQL operations\n- GUI: management interface for products, orders, shipping, and logs\n- Multithreaded execution: each marketplace runs independently\n- Error handling: resilient logging, no process interruption\n- Schedule control: configurable sync interval per marketplace\n⚙️ Technology & Requirements\n- .NET 9 (net9.0)\n- C# 13\n- Windows S...",
        "skills": [
            ".NET",
            "C# Programming",
            "Microsoft SQL Server",
            "Software Architecture",
            "WPF"
        ],
        "budget": "$584\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "qEEG Recording Software Development",
        "description": "I am looking for a developer to create a local desktop application (Windows 10/11) for qEEG data acquisition with the Neurosity Crown EEG headset.\n✅ Goal:\nConnection via Bluetooth (BLE) to the Crown\nLive streaming & visualization of EEG data (time series, FFT/PSD)\nAssignment of channels according to the 10–20 system and checking of electrode contact\nLocal storage incl. export to EDF+ (alternatively CSV/JSON)\nSimple GUI for control & session management\n\n? Technical setup:\nPlatform: Windows 10/11\nLanguage: open (Python, C++, JS/Electron, etc.)\nOffline solution (no cloud)\nImportant: Support for EDF+ export format\n\n? Requirements:\nExperience with BLE, ideally with EEG devices\nKnowledge of EEG signal processing\nExperience with EDF+ desirable\nWillingness to work with limited device...",
        "skills": [
            "Arduino",
            "C Programming",
            "C++ Programming",
            "Python",
            "Software Architecture"
        ],
        "budget": "$528\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Real-Time Web Trading Software Development",
        "description": "I'm looking for a skilled software developer to build a web-based trading software for me. The software will need to:\n\n- Integrate with real-time stock market data.\n- Visualize this data using candlestick charts.\n- Execute trades based on backend logic I will provide.\n- Connect with an Angel One account using their smart API.\n- Handle multiple accounts simultaneously.\n\nThe software should monitor live data and convert it into candlesticks for the frontend. When the specified trading logic is met, the software should automatically execute a trade on the connected Angel One account, set a stop loss, and exit the trade once the target condition is met. \n\nThe ideal candidate should have experience with:\n\n- Developing web-based trading software\n- Real-time data integration\n- Data visualiza...",
        "skills": [
            "JavaScript",
            "MySQL",
            "PHP",
            "Python",
            "Software Architecture"
        ],
        "budget": "$116\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Comprehensive eBay API Integration in C#",
        "description": "? Goal\nThe goal of this module is to develop a complete and modular eBay API integration for a Windows-based middleware application.\n\nThe module consists of:\n1. A C# class encapsulating all relevant eBay API functionality including product sync, order retrieval, and shipping updates.\n2. A GUI for users to manage all account-specific eBay settings such as credentials, price rules, and scheduling.\n? Architectural Guidelines\n- The class must inherit from the abstract base class `MarketplaceConnector`.\n- No direct access to databases or services.\n- Data exchange strictly via `ProductDto`, `OrderDto`, and `ShippingUpdateDto`.\n- Internal helper classes, DTOs, and API handlers are allowed.\n- GUI must support multiple eBay account configurations.\n⚙️ Technology & Development Standards\n- Target ...",
        "skills": [
            ".NET",
            "C# Programming",
            "C++ Programming",
            "Software Architecture",
            "WPF"
        ],
        "budget": "$619\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "OTTO Market API Integration in C#",
        "description": "? Goal\n\nThe goal of this module is to develop a complete and modular API integration for the OTTO Market platform within a Windows-based middleware application.\n\nThe module consists of two parts:\n\n1. A C# class encapsulating all required OTTO API operations such as product transfer, order retrieval, and shipping updates.\n2. A graphical user interface (GUI) to allow users to configure OTTO-related settings, including credentials, price rules, and sync intervals.\n\n? Architectural Guidelines\n\n- The class must inherit from an abstract base class `MarketplaceConnector`.\n- No direct database access is allowed.\n- Data is returned through DTOs: `ProductDto`, `OrderDto`, `ShippingUpdateDto`.\n- Internal helper classes and DTOs are encouraged (e.g., for auth, responses, configuration).\n\n⚙️ Technology...",
        "skills": [
            ".NET",
            "C# Programming",
            "C++ Programming",
            "Software Architecture",
            "WPF"
        ],
        "budget": "$1545\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Full stack Php webpage creation, developing, progamming, bugs fixing, updating, renewing, webshop",
        "description": "More details: This a a great project for the Php developers. Our website is a social platform. It has been running for more than 10 years, and is by now in need of several bug fixings and updates. I.e. Better chat features, a video chat feature, better verification methods among the profiles etc. The php code and backend area itself is also in need of some cleaning out, i.e. old code not in use anymore. \n\nWhat is the primary purpose of the webpage? Community forum or social network\nWhich features are most important for the community forum or social network? User profiles, Messaging system, Discussion boards, Chat features\nWhat level of customization do you need for user profiles? Advanced (fully customizable with templates and themes)",
        "skills": [
            "HTML",
            "JavaScript",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$48 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Fiat to Crypto Onramp Solution",
        "description": "I'm in need of an onramp solution mainly focused on fiat to crypto conversion. This project primarily revolves around developing a platform with robust conversion services. The successful freelancer will have experience in creating user-friendly interfaces and seamless transaction processes. \n\nKey Project Features:\n- Conversion Services: The platform should efficiently convert fiat to crypto.\n- Currency Support: The platform should support conversions from USD to Bitcoin, EUR to Ethereum, and GBP to Litecoin. \n\nIdeal Skills and Experience:\n- Strong background in blockchain technology and cryptocurrency\n- Proven experience in developing conversion services\n- Ability to create user-friendly and efficient platforms\n- Knowledge of different fiat currencies and their corresponding cryptocu...",
        "skills": [
            "Bitcoin",
            "HTML",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$18 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Development of a Construction Management WebApp with Smart Pre-Budgeting",
        "description": "Project Description: Development of a Construction Management WebApp with Smart Pre-Budgeting\nLooking for a developer (or development team) to create a Construction Management WebApp, focused on process digitalization, cost control, and innovation in client interaction.\n\nThe application is intended for construction companies and aims to centralize the management of projects, teams, documents, and budgets, with an innovative feature: automatic pre-budget creation using Artificial Intelligence (AI).\n\nMain Features:\n1. Project Management\nCreation and tracking of construction projects (general data, location, client, status)\n\nStatus updates (planned, in progress, completed)\n\n2. Work and Quantity Map (MTQ)\nStructured in chapters and subchapters\n\nUnits, quantities, unit prices, and totals\n\n3. Te...",
        "skills": [
            "Engineering",
            "MySQL",
            "PHP",
            "Software Architecture",
            "Website Design"
        ],
        "budget": "$2432\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": ".NET Developer for Quick Job",
        "description": "Job Summary:\nWe are seeking a skilled and detail-oriented .NET Developer with strong experience in decompiling .NET applications and reverse-engineering API interactions. The ideal candidate will be responsible for analyzing legacy .NET codebases, identifying data flow mechanisms, and uncovering API endpoints that ingest or transfer data into SQL Server databases.\n\nKey Responsibilities:\n• Decompile .NET applications (primarily .DLL and .EXE files) using tools like dotPeek, ILSpy, or similar.\n• Analyze and reverse-engineer application logic to identify API endpoints, authentication methods, and data transfer patterns.\n• Document the API structures, payloads, and workflows involved in the data ingestion to SQL Server.\n• Reconstruct or replicate identified endpoints as nee...",
        "skills": [
            ".NET",
            "C# Programming",
            "Microsoft SQL Server",
            "Software Architecture",
            "SQL"
        ],
        "budget": "$21 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Web Software Development with Android Support",
        "description": "I need a talented software developer to create a web-based software for me. This project will also require the development of an accompanying mobile application that supports Android. \n\nIdeal Skills and Experience:\n- Expertise in software development, particularly for web\n- Strong knowledge and experience in Android app development\n- Ability to deliver quality work within agreed timelines.",
        "skills": [
            "Android",
            "Java",
            "Mobile App Development",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$10 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Custom VB Toolbar Development for Word",
        "description": "I'm seeking an experienced developer to inspect, edit, and improve an integrated Visual Basic (VB) toolbar in Microsoft Word. This toolbar includes:\n\n- Formatting tools\n- Custom macros\n- Shortcut buttons\n\nThe toolbar works within Microsoft Word and no integration with external services or applications is required. It is compatible with Microsoft 365. \n\nIdeal candidates for this project should have:\n- Extensive experience with Visual Basic and Microsoft Word\n- A strong understanding of Microsoft 365\n- Ability to create custom macros and formatting tools.\n\nCandidates must pass a background check.",
        "skills": [
            "Excel",
            "Software Architecture",
            "VB.NET",
            "Visual Basic",
            "Visual Basic for Apps"
        ],
        "budget": "$8071\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Submarine Hull Design and Analysis in Paramarine",
        "description": "I'm seeking a skilled professional to develop and model a submarine hull form in Paramarine. It’s important to leverage open source data and make reasonable assumptions when necessary. The project encompasses several tasks:\n\n(a) Hull Geometry Development: You'll need to design the pressure hull, outer hull, and appendages. Basic placement and sizing of ballast, trim, and compensation tanks will also be required.\n\n(b) Hydrostatic Curves and Stability Assessment: This will involve evaluating the stability of the hull in surface, submerged, and transition states, as well as generating trim polygons and surface unsinkability plots. Standard hydrostatic and stability plots will be sufficient.\n\n(c) Powering Calculations: This will include calculating all hull-propeller interactio...",
        "skills": [
            "Software Architecture",
            "Software Testing"
        ],
        "budget": "$59\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Private project or contest #39295877",
        "description": "Please Sign Up or Login to see details.",
        "skills": [
            "C Programming",
            "C++ Programming",
            "Metatrader",
            "PHP",
            "Software Architecture"
        ],
        "budget": "N/A"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "ODOO Customization to Match Tally Sales Invoice",
        "description": "I'm looking for a professional who can customize an existing ODOO report - the Sales Invoice Report - to match the exact format of Tally. The customization needs to include:\n\n- Layout and Design: The visual elements of the Tally sales invoice must be replicated in ODOO.\n- Tax Calculation Details: All details are already there in ODOO - no need for any calcuations\nAttached image is what currently ODOO generates - what is needed is the PDF document layout.\nThere are no additional data fields required, the ODOO report needs to replicate exactly what Tally prints out.\n\nI will share the existing module on awarding the project - need on a top priority",
        "skills": [
            "ERP",
            "Odoo",
            "PostgreSQL",
            "Python",
            "Software Architecture"
        ],
        "budget": "$74\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "AI-Powered Chat App with PDF Integration",
        "description": "I'm seeking a developer to create an interactive chat application powered by AI, capable of summarizing and extracting text from 10 preloaded PDFs. These PDFs are publicly available rules, guidelines, office memos of the Government of India \n\nKey Features:\n- The chat application should provide both text summaries and direct excerpts from the PDFs.\n- All 10 PDFs should be preloaded into the app, as opposed to manually uploaded by the user. I should be able rk load more PDFs as they evolve and more are issued by the government.\n- The user interface should be a fully interactive chat dashboard, not just a simple text-based chat window or a basic graphical interface.\n\nIdeal Skills:\n- Proficient in AI and machine learning\n- Experience in developing interactive chat applications\n- Familiar ...",
        "skills": [
            "Android",
            "Graphic Design",
            "Mobile App Development",
            "Software Architecture",
            "User Interface / IA"
        ],
        "budget": "$103\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Real-Time Online Multiplayer Game Market Tracker",
        "description": "I'm looking for a Python and React expert to build a real-time dashboard for tracking market trends in online multiplayer PC games. \n\nKey Features:\n- Utilization of network sniffing techniques to gather data.\n- Display comprehensive market trends in an easy-to-understand format.\n\nIdeal Skills:\n- Proficient in Python and React.\n- Experience in creating real-time dashboards.\n- Knowledge of online multiplayer PC games.\n- Familiarity with network sniffing tools and techniques.\n- Understanding of game market metrics and trends. \n\nIf you have the skills and experience to undertake this project, I look forward to your bid.",
        "skills": [
            "C++ Programming",
            "Java",
            "Machine Learning (ML)",
            "Python",
            "Software Architecture"
        ],
        "budget": "$25\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Web-based Field Inspection App Development",
        "description": "I'm looking for a web-based application that aids in field inspections for a water utility. This app should enable the import of customer and water service data from spreadsheets, facilitate documentation of plumbing defects and service classification during inspections, generate tracking letters for due dates, and run reports.\n\nKey Features:\n- Data Import: Ability to import from spreadsheets customer information, water service details, inspection history, and backflow device information.\n- Field Documentation: Use during inspections to document plumbing defects and classify the service.\n- Reporting: Ability to generate letters, track due dates, and run reports.\n\nUser Authentication:\n- The app requires a simple username and password authentication system to ensure secure access.\n\nIdea...",
        "skills": [
            "iOS Development",
            "Mobile App Development",
            "MySQL",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$20 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Python Developer for Data Analysis",
        "description": "I'm in need of a skilled Python developer with expertise in data analysis, specifically with text data. The primary focus of this project will be analyzing text data sourced from a database and create some models. This project is ideal for someone who has strong programming skills and experience with Python's data analysis libraries, such as pandas and NLTK. \n\nKey requirements:\n- Proficiency in Python programming\n- Experience in data analysis, specifically with text data\n- Familiarity with data extraction from a database\n- Knowledge of Python's data analysis libraries, such as pandas and NLTK\n- Ability to interpret data and provide insights",
        "skills": [
            "Data Mining",
            "Machine Learning (ML)",
            "Python",
            "Software Architecture",
            "Web Scraping"
        ],
        "budget": "$3 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Wi-Fi APK Manager Android App",
        "description": "I'm looking for an experienced Android developer to create a utility application for me. This application will facilitate the installation, uninstallation, and management of APK files on a second Android device, all over Wi-Fi using ADB commands. Please note, all devices will be in Developer Mode and have ADB over Wi-Fi enabled.\n\nKey Features:\n- Simple, intuitive dashboard with clear action buttons (Connect, Load APK, Install, Uninstall).\n- Comprehensive logs and feedback for each operation (success, failure, in progress).\n- Device discovery via a saved device list.\n\nThe application should provide logs that indicate success and failure messages.",
        "skills": [
            "Android",
            "Java",
            "Mobile App Development",
            "PHP",
            "Software Architecture"
        ],
        "budget": "$634\n                                                                    \n                                        Avg Bid"
    },
    {
        "url": "https://www.freelancer.com/jobs/software-architecture/",
        "title": "Paramiko Assistance for Command Execution - python",
        "description": "I'm in need of a quick, easy fix for a Paramiko script running on my local Linux machine. The script is supposed to send a password as a second command, which appears as a prompt in the CLI. This task should only take a couple of minutes for someone who has experience with this. \n\n- The script's purpose is to execute a command over SSH.\n- The task is simple and straightforward for someone with prior experience. \n\nIdeal skills for this project include:\n- Proficiency in Python, particularly with the Paramiko library.\n- Understanding of SSH commands and their usage.\n- Experience with Linux operating systems.",
        "skills": [
            "Linux",
            "Python",
            "Shell Script",
            "Software Architecture"
        ],
        "budget": "$10\n                                                                    \n                                        Avg Bid"
    }
]