[
    {
        "title": "Modern Residential House Design with Smart Tech",
        "description": "I'm looking for a professional with experience in modern residential architecture to assist me with the design of a house.\n\nKey Tasks Include:\n- Collecting references for house plans\n- Determining a suitable house model\n- Researching requirements for each room\n- Creating sketches\n- Detailing and including furniture and appliances\n- Developing alternative layouts\n\nIdeal Skills:\n- Proficiency in modern design principles\n- Experience with smart home technology\n- Strong research and sketching skills\n- Ability to create comprehensive and detailed plans",
        "skills": [
            "ত্রিমাত্রিক রুপান্তরণ",
            "অটোসিএডি",
            "বিল্ডিং আর্কিটেকচার",
            "ঘরোয়া ডিজাইন",
            "ইন্টেরিয়র ডিজাইন"
        ],
        "budget": "$270\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Classic Label Design for HydroSip",
        "description": "I'm seeking an experienced graphic designer to create a classic-styled water bottle label for my company, HydroSip. The design should communicate a premium quality, enhancing the perceived value of our product. \n\nKey Requirements:\n- Proficiency in graphic design, ideally with experience in packaging design.\n- Understanding of classic design elements and aesthetics.\n- Ability to convey a premium message through design.\n\nPlease provide a portfolio of relevant work with your bid.",
        "skills": [
            "ব্রশিউর ডিজাইন",
            "কর্পোরেট পরিচিতি",
            "মোড়ক ও প্যাকেজিং",
            "গ্রাফিক ডিজাইন",
            "লোগো ডিজাইন"
        ],
        "budget": "$14\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Residential New Build Construction Agreement",
        "description": "I need a comprehensive construction work agreement tailored for a residential new build project. This agreement should primarily cover the use of concrete as the main building material.\n\nKey Requirements:\n- Familiarity with residential construction legalities\n- Experience in drafting construction agreements\n- Knowledge of concrete construction specifics\n- Ability to ensure the agreement covers all necessary construction phases",
        "skills": [
            "চুক্তিসমূহ"
        ],
        "budget": "$488\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "AI Video Generation",
        "description": "I am looking for someone having experience in  training/hosting AI models that can generate AI Videos - for promotion of products/merchandise and other types of AI Videos - reels, character videos and such.",
        "skills": [
            "কৃত্রিম বুদ্ধিমত্তা",
            "ডিপ নিউরাল নেটওয়ার্ক",
            "Hugging Face",
            "বড় ভাষার মডেল (LLMs)",
            "নিউরাল নেটওয়ার্ক"
        ],
        "budget": "$271\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Printable PDF Cryptogram Maths Puzzle for Kids",
        "description": "I'm looking for a cryptogram maths puzzle based on the statement about Tidbinbilla and its role in NASA's communications with space missions. The puzzle should be designed for children aged 6 to 12, making it a fun and educational challenge.\n\nKey Requirements:\n- The puzzle should be in a printable PDF format.\n- The difficulty level should be appropriate for 6 to 12 year olds.\n- Basic math should be used as the cryptography method.\n\nIdeal Skills:\n- Experience in creating educational content for children.\n- Strong understanding of basic mathematics and cryptography.\n- Proficiency in designing printable PDF content. \n\nI would like the answer to the cryptogram to be\n\nTidbinbilla helps NASA talk to space missions. It is one of three stations that communicate with spacecraft.\n\nI have a...",
        "skills": [
            "শিক্ষা ও শিক্ষন",
            "গেম ডিজাইন",
            "গ্রাফিক ডিজাইন",
            "গণিত"
        ],
        "budget": "$31"
    },
    {
        "title": "Logo & Product Label Design $35 Tops!",
        "description": "I'm looking for a designer to refine my logo, apply a gold effect, and create labels for several of my products. \n\n- Logo cleanup: I've sketched most of the logo, I just need someone to polish it and prepare various size files for me.\n- Product labels: The design work is $20 per label. You'll need to prepare different files and upload the full file and elements to my Drive folder.\n\nIf you're talented, this could lead to more work at an increased pay.",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "ইলাস্ট্রেটর",
            "লোগো ডিজাইন",
            "ফটোশপ",
            "ফটোশপ ডিজাইন"
        ],
        "budget": "$44\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Modern Clothing Line Designer Needed",
        "description": "I'm in need of a talented designer who can create engaging, modern designs for a clothing line that includes primarily T-shirts, but also hoodies and pants. The designs should be illustrative and suitable for embroidery.\n\nKey Requirements:\n- Design and branding for T-shirts, with some focus on hoodies and pants\n- Creation of modern, illustrative designs that can be embroidered\n- Experience in clothing design and branding\n- Strong portfolio of modern, illustrative work\n\nIncorporating Branding Elements:\n- Strategically placing the logo on designs\n- Integrating the tagline or slogan within designs\n- Designing custom tags or labels for the clothing\n\nPlease include relevant samples from your portfolio in your proposal.",
        "skills": [
            "কম্পিউটারাইজড এম্ব্রয়ডারি",
            "ফটোশপ",
            "ফটোশপ ডিজাইন",
            "টি-শার্ট"
        ],
        "budget": "$49\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "2D Standard Rigging for VTuber Model",
        "description": "I need a professional with experience in Standard 2D Rigging for a pre-made VTuber model. The model should be rigged to convey a few specific emotes, in addition to basic expressions. \n\nSpecific expressions/emotes required:\n- Happy and Sad\n- Angry and Surprised\n- Blushing and Laughing\n\nIdeal skills for this job include:\n- Proficiency in Standard 2D Rigging\n- Experience with VTuber models\n- Ability to create a range of emotes from specific expressions \n\nThe successful freelancer will demonstrate a keen understanding of 2D rigging and will be able to deliver a well-rigged model.",
        "skills": [
            "2D অ্যানিমেশন",
            "2D গেম আর্ট",
            "Maya"
        ],
        "budget": "$105\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "2D Animator Needed for Logo Transformation",
        "description": "I'm seeking a skilled 2D animator to bring our logo to life with complex, transformative movements. The animated logo will primarily be used over video content, so it needs to be visually engaging and versatile. \n\nKey Requirements:\n- Expertise in 2D animation\n- Experience with complex motion design\n- Ability to deliver high-quality animation suitable for video content\n\nIdeal Candidates:\n- Have a strong portfolio of 2D animations\n- Have experience with logo animation\n- Can work to a deadline and deliver high-quality work.",
        "skills": [
            "অ্যানিমেশন",
            "মোশন গ্রাফিক্স"
        ],
        "budget": "$196\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Azure Administrator Needed for VM & AD",
        "description": "I'm seeking an experienced Azure Administrator proficient in managing Azure Virtual Machines and Azure Active Directory. \n\nKey Responsibilities:\n- Provisioning and setting up Azure Virtual Machines.\n- Handling user management tasks within Azure Active Directory.\n- Setting up Single Sign-On (SSO) in Azure AD.\n\nIdeal Skills:\n- Extensive experience with Azure services, specifically Virtual Machines and Azure Active Directory.\n- Proficiency in the provisioning and setup of Azure Virtual Machines.\n- Expertise in user management and SSO configuration in Azure AD.\n- Strong understanding of Azure's best practices for deployment and management.",
        "skills": [
            "Amazon ওয়েব সেবা",
            "Azure",
            "ক্লাউড কম্পিউটিং",
            "মাইক্রোসফট এসকিউএল সার্ভার",
            "Windows Server"
        ],
        "budget": "$10 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "100-Year Finance Brand Website Overhaul",
        "description": "I'm looking for a comprehensive revamp of my finance-related 100 years 100-year-old legacy Brand site, which has been consistently getting admiration. The project involves both a design update and enhancing the site's usability and mobile responsiveness. The ultimate goal is to bring this legacy brand up to modern web standards while also improving its SEO.\n\nKey aspects of the project include:\n- Implementing a fresh, modern design while still respecting the brand's historical significance.\n- Enhancing the site's usability to ensure a seamless user experience.\n- Making the site fully mobile responsive to cater to today's users.\n- Comprehensive SEO improvements, covering both on-page and technical SEO, as well as link building.\n\nIdeal candidates for this project shou...",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "HTML",
            "ইন্টারনেট বিপণন",
            "এসইও",
            "ওয়েবসাইট ডিজাইন"
        ],
        "budget": "$401\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Android Photo Capturing App Development",
        "description": "I'm looking to develop an Android app focused on capturing photos. The app should be user-friendly and capable of taking high-quality pictures. While the main purpose is photo capturing, the potential for future updates to include editing features exists, so some foresight in the design would be beneficial. \n\nIdeal skills and experience for the job include:\n- Proficiency in Android app development\n- Experience with photo capturing software development\n- Ability to design user-friendly interfaces\n- Foresight for potential future updates and features\n- Knowledge of high-quality photo capturing techniques",
        "skills": [
            "অ্যান্ড্রয়েড",
            "আইফোন",
            "জাভা",
            "মোবাইল অ্যাপ ডেভেলপমেন্ট",
            "সফটওয়্যার আর্কিটেকচার"
        ],
        "budget": "$269\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "E-Commerce Graphic Design Specialist -- 2",
        "description": "I am looking for a seasoned Graphic Designer with a focus on E-Commerce to tailor design for my website. \n\nKey Responsibilities:\n- Design elements primarily focusing on an appealing and effective product showcase.\n- Understanding of the necessity for branding consistency across the site.\n\nThe ideal candidate should be proficient in graphic design with a strong portfolio in designing for E-Commerce websites. Skills in creating visually appealing product displays and understanding of the principles of user-friendly design and branding consistency are crucial. Experience in utilizing design to enhance product visibility and desirability is a big plus.",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "ইলাস্ট্রেটর",
            "লোগো ডিজাইন",
            "ফটোশপ",
            "ফটোশপ ডিজাইন"
        ],
        "budget": "$18 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Backstage.io Software Template with Terraform",
        "description": "I am in need of a  Software template which can spin up Infrastructure as Code (IaC) using Terraform on the Google Cloud Platform. The template should include the components from the provided Github link:  \n\nThe ideal freelancer for this project should have:\n- Extensive experience with  and Terraform.\n- Deep understanding of Google Cloud Platform.\n- Proficiency in using and modifying open-source Terraform modules.\n\nKey project requirements:\n- A  Software template that can create the specified infrastructure components: compute instances, networking components, and storage solutions.\n- Utilization of appropriate open-source Terraform modules to facilitate the project.",
        "skills": [
            "Google Cloud Platform",
            "Kubernetes",
            "Terraform"
        ],
        "budget": "$30 - $250"
    },
    {
        "title": "Company Website Development from Scratch",
        "description": "I'm looking for a skilled web developer to create a comprehensive company website from the ground up. The website should be professionally designed and serve as an informative platform about our company and its services. \n\nKey Sections:\n- 20-25 pages\n- high end UX/UI design and graphics/vectors\n- Marketing material template designs \n\nIdeal Skills and Experience:\n- Proficient in web development languages (HTML, CSS, JavaScript, etc.)\n- Experienced in creating business-oriented websites\n- Good understanding of UX/UI design principles\n- Ability to convey complex information in a clear and engaging manner.",
        "skills": [
            "CSS",
            "গ্রাফিক ডিজাইন",
            "HTML",
            "ব্যবহারকারীর ইন্টারফেস / IA",
            "ওয়েবসাইট ডিজাইন"
        ],
        "budget": "$863\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Logo Integration in Video Footage for 4 videos And URL if needed",
        "description": "I require assistance to seamlessly integrate my business logo into four of my videos. The adjustments will include removing a mockup logo from one of the videos. \n\nKey Responsibilities:\n- Evaluate and determine the optimal placement of the logo across various videos, prioritizing aesthetics and visibility\n- Remove a mockup logo from one of the videos \n- Ensure the final product maintains high video quality and professional standards \n\nKey Details:\n- Video Length: All videos are under 1 minute \n- Video Format: All videos are in MP4 \n\nIdeal Skills and Experience:\n- Proficiency in video editing software \n- Prior experience with logo integration in videos \n- Strong understanding of visual aesthetics and branding \n- Ability to deliver high-quality work within a reasonable timeframe",
        "skills": [
            "After Effects",
            "গ্রাফিক ডিজাইন",
            "ভিডিও সম্পাদনা",
            "ভিডিও প্রস্তুত",
            "ভিডিও সেবাসমূহ"
        ],
        "budget": "$9"
    },
    {
        "title": "Buscamos vendedores freelance en Colombia para agendar discovery calls sobre servicios de diseño UX y producto digital",
        "description": "En SimpleDot, agencia especializada en el diseño y mejora de productos digitales, buscamos vendedores freelance en Colombia interesados en colaborar en la generación de oportunidades comerciales.\n \nTu objetivo será agendar discovery calls calificadas con empresas que puedan beneficiarse de nuestros servicios. El modelo de trabajo debe ser freelance, y esperamos recibir una propuesta económica clara basada en comisiones por resultados.\n \nServicios que ofrecemos:\n-Investigación de usuarios y pruebas de usabilidad\n-Diseño UX/UI de productos digitales\n-Estrategia de producto digital\n-Diseño e implementación de Design Systems\n-Integración de inteligencia artificial en procesos de diseño\n \n¿Qué buscamos?\n-Freelan...",
        "skills": [
            "ব্যবসায়িক পরামর্শ",
            "কল সেন্টার",
            "Hubspot",
            "পরিচালনা করে",
            "বিক্রয়"
        ],
        "budget": "$1826\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "3D Floor Renderings Expert Needed",
        "description": "We’re a dynamic and fast-growing creative agency that brings concepts to life through design, branding, and immersive visual experiences. We're currently expanding our design capabilities and looking for a talented 3D Designer who specializes in floor plans and space renderings.\n\nWhat You’ll Do:\n\nCreate high-quality 3D renderings of floor layouts for retail, commercial, and experiential spaces\n\nCollaborate with our creative and project management teams to interpret design briefs\n\nTranslate sketches, moodboards, and floor plans into realistic 3D visualizations\n\nApply textures, lighting, and realistic materials for impactful presentations\n\nIterate designs based on feedback and deliver optimized files for both web and print\n\nRequirements:\n\nProven experience with 3D rendering ...",
        "skills": [
            "ত্রিমাত্রিক অ্যানিমেশন",
            "৩ডি ডিজাইন",
            "ত্রিমাত্রিক মডেলিং",
            "ত্রিমাত্রিক রুপান্তরণ",
            "3ds Max"
        ],
        "budget": "$88\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Functional Prototype 3D Print File Creation",
        "description": "I'm in need of a skilled 3D designer who can create a 3D print file for a functional prototype. This file should be ready for 3D printing.\n\nIdeal skills for this project include:\n- Proficiency in 3D modeling software\n- Experience in designing for 3D printing\n- Understanding of functional prototype requirements\n\nPlease note, the specific 3D printing material has not yet been determined, so the design should be adaptable to various materials. If you have experience with any particular types of materials, please feel free to mention this in your proposal.\n\nSee attached files of existing 3D model. I need these to be modified in such a way to be able to produce dough \"Dumbbells\" instead of \"balls\". \n\nWatch the following Youtube video to see how the device works.\"Sa...",
        "skills": [
            "ত্রিমাত্রিক অ্যানিমেশন",
            "৩ডি ডিজাইন",
            "ত্রিমাত্রিক মডেলিং",
            "ত্রিমাত্রিক রুপান্তরণ",
            "Solidworks"
        ],
        "budget": "$186\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Builders Labourer or a masonry block layer Needed",
        "description": "I need physical labor assistance for a project. The task involves moving and installing 40 off 200 series masonry blocks within a timeframe of 6 hours. \n\nIdeal Skills:\n- Physical strength and endurance\n- Ability to follow instructions\n\nPlease note, no special skills or experience are required for this job. Standard safety practices will be in place.",
        "skills": [
            "ইমারত",
            "মেসনরি"
        ],
        "budget": "$9 - $16 / hr"
    },
    {
        "title": "Modern Minimalist Single Page PHP Website",
        "description": "I'm looking for a Frontend Developer to design a custom, modern and minimalist single page website. The backend is already set up in PHP, so your focus will solely be on the frontend. \n\nKey responsibilities:\n- Create a sleek, user-friendly design that aligns with a modern and minimalist theme.\n- Incorporate text and images provided into the design in a visually appealing way.\n- Follow specific brand guidelines and color schemes that I will provide.\n\nIdeal skills and experience:\n- Proficiency in frontend web technologies (HTML, CSS, JavaScript).\n- Previous experience designing modern minimalist websites.\n- Ability to implement provided brand guidelines accurately.",
        "skills": [
            "CSS",
            "গ্রাফিক ডিজাইন",
            "HTML",
            "পিএইচপি",
            "ওয়েবসাইট ডিজাইন"
        ],
        "budget": "$26\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Modern Minimalist Website UI Design",
        "description": "I'm seeking a UI designer for a modern and minimalist website. The design should be clean, user-friendly, and aesthetically pleasing, following current best practices in UI/UX design.\n\nIdeal candidates should have:\n- Proven experience in website UI design\n- Strong portfolio featuring modern, minimalist designs\n- Proficiency in design tools like Sketch, Figma, or Adobe XD\n- Understanding of responsive design principles\n\nPlease note that a detailed brief of the specific pages will be provided after selection. Your ability to translate these requirements into a sleek, intuitive design will be key to the success of this project.",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "HTML",
            "ব্যবহারকারীর ইন্টারফেস / IA",
            "ওয়েবসাইট ডিজাইন"
        ],
        "budget": "$55\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "UI/UX Design for Mobile Social Media App",
        "description": "I'm looking for a skilled UI/UX designer to help design a mobile-focused social media app. The design needs to cater to both iOS and Android platforms, ensuring a seamless user experience across devices.\n\nKey Features:\n- The app will include messaging capabilities\n- Photo and video sharing functions\n- User profiles\n\nIdeal Skills:\n- Extensive experience in designing mobile applications, particularly social media apps\n- Proficiency in designing for both iOS and Android platforms\n- Strong understanding of UI/UX principles\n- Ability to create engaging and intuitive designs\n- Preference will be given If u have US or Europe work experience\n\nExperience:\n- Previous work on messaging, photo/video sharing, and user profile features will be highly considered\n- A portfolio demonstrating successfu...",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "আইফোন",
            "মোবাইল অ্যাপ ডেভেলপমেন্ট",
            "ব্যবহারকারীর ইন্টারফেস / IA",
            "UX / ইউজার অভিজ্ঞতা"
        ],
        "budget": "$14 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Trade Operation Order Management System",
        "description": "Order Management System for Trading\n\nI'm seeking a developer to implement an Order Management System for my international trading company. This system will manage the entire procurement process from product catalog to vendor fulfillment and customs processing. Despite having multiple features, this is a straightforward project with exceptionally clear documentation. I've prepared detailed specifications and HTML examples for all pages, making this an organized and well-defined implementation task that can be completed quickly.\nWhat Makes This Easy\n\nMust be completed within a few days\nComprehensive, clear specifications\nHTML templates for all pages provided\nWell-defined database structure\nStep-by-step implementation instructions\n\nCore Features\n\nRole-based system (Admin, Office, Cu...",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "HTML",
            "পিএইচপি",
            "সফটওয়্যার আর্কিটেকচার",
            "ওয়েবসাইট ডিজাইন"
        ],
        "budget": "$195\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Vintage Cafe Logo Design -- 2",
        "description": "I'm looking for a vintage-style logo for my cafe. The logo should incorporate the name of the cafe and the establishment year. \n\nKey Aspects:\n- Style: The logo must reflect a vintage aesthetic, so understanding of vintage design elements is crucial.\n- Content: The cafe name and establishment year must be included.\n- Color Scheme: The logo should utilize warm tones, such as browns and oranges. \n\nIdeal candidates will have a portfolio showcasing similar vintage design work, with a strong understanding of color and composition. Experience in logo design is a must.",
        "skills": [
            "৩ডি ডিজাইন",
            "গ্রাফিক ডিজাইন",
            "ইলাস্ট্রেটর",
            "লোগো ডিজাইন",
            "ফটোশপ"
        ],
        "budget": "$50 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "For making online presence for my finance company",
        "description": "I need a skilled web developer to build an informative website for my company. The site should encompass several key sections: 'About Us', 'Services', 'Contact Us', 'Home', 'Calculators', and 'Book Appointment'.\n\nKey Requirements:\n- Comprehensive understanding of web development\n- Prior experience in creating informational websites\n- Ability to integrate interactive elements like calculators and booking forms\n- Proficiency in ensuring the website is user-friendly and accessible\n\nThe primary objective of this website is to relay important company information to our visitors. Therefore, a knack for presenting information in an engaging and clear manner will be greatly appreciated.",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "HTML",
            "পিএইচপি",
            "ওয়েবসাইট ডিজাইন",
            "ওয়ার্ডপ্রেস"
        ],
        "budget": "$233\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Instructional Video Editing for Fitness Pros",
        "description": "I'm looking for a skilled video editor to turn raw footage from gyms, trainers, and fitness influencers into clean, engaging instructional videos.\n\nWhat I Need:\nEdit and improve the clarity and flow of workout/instructional content\n\nCreate content that's well-suited for YouTube's audience\n\nAdd clean transitions, pacing, and visuals to keep viewers engaged\n\nSkills:\nProficiency in any video editing software\n\nGood understanding of YouTube video style and viewer expectations\n\nStrong sense of timing and storytelling through visuals\n\nYour edits will help reach fitness lovers and make our content both helpful and engaging.",
        "skills": [
            "সম্পাদনা",
            "ভিডিও সম্পাদনা",
            "ভিডিও প্রস্তুত",
            "ভিডিও সেবাসমূহ",
            "ভিডিওগ্রাফি"
        ],
        "budget": "$13\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Creación de hoja de sprites 2D para personaje basado en diseño existente",
        "description": "? Descripción del proyecto:\n¡Hola! Estoy buscando a un animador/a con experiencia en sprites o animación 2D (idealmente en Unity o con experiencia en juegos tipo pixel art/acción lateral) para crear los movimientos de un personaje femenino ninja que forma parte de un juego con historia profunda y estética estilo indie/oscura.\nSobre el personaje:\nSu nombre es Ayame, conocida como El Destello Carmesí. Es una ninja letal y eficiente, cuya misión principal es rescatar a su hermano secuestrado por criaturas de sombra que emergieron de un portal interdimensional. Vive en un mundo ficticio que mezcla elementos culturales de Japón, China y México.\n¿Qué necesito?\nPor ahora, quiero enfocarme en sus movimientos básicos...",
        "skills": [
            "2D অ্যানিমেশন",
            "চরিত্র ইলাস্ট্রেশন",
            "গেম ডিজাইন",
            "পিক্সেল আর্ট",
            "Unity"
        ],
        "budget": "$27\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Nursery Rhymes Video Songs For Preschool Kids #6",
        "description": "I'm looking for someone who is smart and can record some action songs for preschool kids. No previous experience is required. You can use your phone camera to record the videos.\n\nYou only have to act/dance based on the songs we provide. You will get the payments for each video song you record.\n\nIt's just 3-5 minute long videos and it depends on the song.\n\nPlease take a look at the example videos:\n\n============== ============== ==============\n\n============== ============== ==============\n\nNOTE: I will provide you with all the reference song for each video.\nAlso, you must be in SAREE for more professional looks.",
        "skills": [
            "প্রতিলিপি টাইপকরণ",
            "কাস্টমার সাপোর্ট",
            "ডাটা এন্ট্রি",
            "ভার্চুয়াল অ্যাসিস্ট্যান্ট",
            "Word"
        ],
        "budget": "$2 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Abaqus Structural Analysis Expert Needed",
        "description": "I'm seeking an experienced professional in Abaqus for a comprehensive structural analysis. I need to understand the stress distribution, deformation patterns, and potential failure points of a given structure. \n\nKey Requirements:\n- Proficient in Abaqus for structural analysis\n- Able to simulate and interpret stress distribution\n- Capable of identifying deformation patterns and failure points\n\nAdditionally, the simulation should incorporate relevant material properties, specifically:\n- Elasticity\n- Plasticity\n\nIdeal Skills:\n- Expertise in structural analysis simulations\n- Strong understanding of material properties\n- Excellent interpretation and reporting skills\n\nThe successful candidate will provide insights based on the simulation results and help in understanding the structural inte...",
        "skills": [
            "প্রকৌশল",
            "সীমিত উপাদান গবেষণা",
            "যন্ত্র প্রকৌশল",
            "পারিসাংক্ষিক বিশ্লেষণ",
            "গঠন প্রকৌশল"
        ],
        "budget": "$21\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "lataforma Web para Gestión de Bots",
        "description": "Busco un desarrollador Full Stack (preferiblemente con experiencia en automatización de videojuegos o interfaces que gestionan configuraciones) para terminar una plataforma web que permita a los usuarios administrar sus bots personales de un juego, cada uno representado por un archivo JSON local con su configuración individual.\n\nSepa trabajar con archivos locales (.json) desde backend.\n\nTenga experiencia real con FastAPI y React (idealmente juntos).\n\nSepa cómo manejar errores, validaciones y rutas protegidas.\n\nSe comunique bien, proponga mejoras y pueda entregar soluciones estables.",
        "skills": [
            "AngularJS",
            "JavaScript",
            "Node.js",
            "NoSQL Couch & Mongo",
            "পিএইচপি"
        ],
        "budget": "$495\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Comprehensive Old Home Photo Editing",
        "description": "I need a skilled photo editor to enhance an image of my old home. The tasks include:\n\n- Color correction for a more vibrant appearance\n- Removing unwanted objects from the scene\n- Restoration of damaged areas to improve the overall aesthetic\n- Adding specific items as per my instructions\n- Amending some items to better fit the desired look\n\nThe ideal freelancer for this project should have extensive experience in photo editing and restoration. Proficiency in software like Adobe Photoshop is a must. A keen eye for detail and ability to follow instructions precisely will be key to delivering a satisfactory outcome.",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "ছবি সম্পাদনা",
            "ফটোগ্রাফি",
            "ফটোশপ",
            "ফটোশপ ডিজাইন"
        ],
        "budget": "$37\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Personal Branding LinkedIn Banner Design",
        "description": "I'm in need of a professional LinkedIn banner that aligns with my personal branding. The design should be distinctly professional, avoiding overly casual or creative styles. \n\nSkills and Experience Required:\n- Graphic Design: Expertise in creating visually appealing and professional designs\n- LinkedIn Familiarity: Understanding of what typically works on LinkedIn\n- Branding: Ability to reflect personal branding in design\n- Creativity: Unique design ideas that stand out while remaining professional\n\nPlease note that the specifics of the design can be discussed further.",
        "skills": [
            "ব্যানার ডিজাইন",
            "গ্রাফিক ডিজাইন",
            "লোগো ডিজাইন",
            "ফটোশপ",
            "পোস্টার ডিজাইন"
        ],
        "budget": "$11\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Instagram Reels Creation for Organic Nation",
        "description": "I am looking for a skilled content creator to produce informative and educational Instagram Reels for my brand, Organic Nation. The primary objective of these videos is to enhance our brand awareness.\n\nKey Responsibilities:\n- Creating Instagram Reels that demonstrate our products and provide a glimpse behind-the-scenes of our operations.\n- Ensuring the content is informative and educational, yet engaging enough to resonate with our audience.\n\nIdeal Skills:\n- Proven experience in creating Instagram content, particularly Reels.\n- Excellent understanding of Instagram's algorithm and trending content styles.\n- Ability to convey information in a clear, engaging and educational manner.\n- Experience with product demonstration videos and behind-the-scenes content.\n\nPlease provide examples of ...",
        "skills": [
            "ফেসবুক বিপণন",
            "ইন্সটাগ্রাম",
            "ইন্টারনেট বিপণন",
            "সামাজিক মাধ্যমে বিপণনকারী",
            "Twitter"
        ],
        "budget": "$2047\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Legal Document Prep for Restraining Order",
        "description": "I require a professional to assist in the preparation of my restraining order application. The tasks include:\n\n- Assisting with the personal information section\n- Aiding in the incident description section\n- Helping articulate the requested protections section\n\nThis project is specifically aimed at someone who is experienced and knowledgeable in legal document preparation in the context of restraining orders, ideally with a focus on Los Angeles, California. Your expertise will be crucial in ensuring my application is correctly prepared and presented.",
        "skills": [
            "চুক্তিসমূহ",
            "চাকুরি আইন",
            "আইন-সংক্রান্ত",
            "আইন-সংক্রান্ত গবেষণা",
            "আইন বিষয়ক লেখেলেখি"
        ],
        "budget": "$142\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "YouTube Gaming Channel Video Editor Needed",
        "description": "I'm launching a gaming YouTube channel and am in need of an editor to polish my videos for $80 per 30-minute video. The editing required is quite minimal, as I prefer a laid-back style with few effects. \n\nKey Editing Tasks:\n- Cutting unnecessary footage to maintain a smooth flow\n- Adding background music to set the mood\n- Inserting text or subtitles at designated spots\n\nThe ideal candidate should have experience with video editing and a good understanding of pacing for gaming content. The editor will have the creative freedom to select the background music from royalty-free sources. \n\nPlease provide examples of your previous work, particularly any related to gaming content, as well as your proposed turnaround time for a 30-minute video.",
        "skills": [
            "সম্পাদনা",
            "ভিডিও সম্পাদনা",
            "ভিডিও প্রস্তুত",
            "ভিডিও সেবাসমূহ",
            "ভিডিওগ্রাফি"
        ],
        "budget": "$80\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Complete Wordpress Website Page Conversion",
        "description": "I'm looking for a freelancer who can convert my current WordPress website pages into a new format. The project involves:\n\n- Converting all existing WordPress website pages to a new format.\n- Ensuring the integrity of the content and layout during the conversion process.\n- Retaining the SEO-friendly structure of the original pages.\n\nIdeal skills and experience for the job include:\n\n- Proficiency in WordPress, HTML and CSS.\n- Prior experience in website page conversion.\n- Strong attention to detail.\n- Knowledge of SEO best practices.",
        "skills": [
            "CSS",
            "HTML",
            "পিএইচপি",
            "ওয়েবসাইট ডিজাইন",
            "ওয়ার্ডপ্রেস"
        ],
        "budget": "$63\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Unity Lighting Artist for Indoor Scene",
        "description": "I'm looking for a seasoned Unity lighting artist who specializes in creating realistic natural lighting for indoor scenes. Your primary task will be to enhance the visual appeal of the environment, while ensuring the lighting is true to life. \n\nKey Responsibilities:\n- Develop and implement natural lighting setups for a variety of indoor scenarios\n- Ensure the lighting contributes to a realistic portrayal of the scene\n- Collaborate with the design team to align on visual goals\n\nPlease reach out with the sample link to the scene which have metal and glass objects",
        "skills": [
            "ত্রিমাত্রিক রুপান্তরণ",
            "সি# প্রোগ্রামিং",
            "Unity 3D"
        ],
        "budget": "$99\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Telemarketing Specialist Needed – Commission-Based (Teachers, Professors, Students & Institutions)",
        "description": "We are looking for an experienced telemarketer to make outbound calls to teachers, professors, students, and educational institutions to promote our services. The role involves generating leads, explaining our offerings, and converting prospects into clients.\n\nlink :\n\nKey Responsibilities:\nMake outbound calls to the provided leads (teachers, professors, students, institutions).\n\nExplain our services clearly and professionally.\n\nGenerate qualified leads and set appointments if required.\n\nMaintain a professional and persuasive tone.\n\nFollow up with potential clients via call/email/WhatsApp.\n\nRequirements:\nExcellent English communication skills (fluency & clarity).\n\nPrior experience in telemarketing, cold calling, or sales.\n\nStrong persuasion and negotiation skills.\n\nReliable internet con...",
        "skills": [
            "ইন্টারনেট বিপণন",
            "বিপণন",
            "বিক্রয়",
            "টেলিবিপণন",
            "টেলিফোন হ্যান্ডলিং"
        ],
        "budget": "$69\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "I'm looking for an experienced app submission devloper..",
        "description": "I'm looking for an experienced app submission developer to assist with submitting my app to the Apple App Store and Google Play Store. All necessary materials including screenshots, icons, feature graphics, privacy policies, and descriptions will be provided.",
        "skills": [
            "অ্যান্ড্রয়েড",
            "গ্রাফিক ডিজাইন",
            "আইফোন",
            "মোবাইল অ্যাপ ডেভেলপমেন্ট",
            "অবজেক্টিভ সি"
        ],
        "budget": "$137\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Social Media Video Editing",
        "description": "I need a video editor skilled in creating compelling promotional content for social media. The video will primarily be aimed at Instagram and YouTube. \n\nKey Responsibilities:\n- Edit footage into an engaging, high-quality social media ad\n- Ensure content is suitable for, and optimised for, Instagram and YouTube\n\nIdeal Skills:\n- Proven experience in video editing for social media, particularly Instagram and YouTube\n- Strong understanding of what makes content engaging on these platforms\n- Ability to deliver high-quality, professional content",
        "skills": [
            "সৃজনশীল লেখালেখি",
            "ভিডিও সম্পাদনা",
            "ভিডিও প্রস্তুত",
            "ভিডিও সেবাসমূহ",
            "ভিডিওগ্রাফি"
        ],
        "budget": "$10 / hr\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "list of all shopify websites and WooCommerce websites in Australia",
        "description": "Generate an xlsxl spreadsheet list of all shopify websites and WooCommerce websites in Australia. With that list any contact information available for those websites. for example Email addresses and social media links. There are approx. 138,858 shopify sites in Australia and 85,116 WooCommerce sites.\n\nI can it from  for $250 US so you will have to come in better than that.",
        "skills": [
            "ডাটা এন্ট্রি",
            "ডাটা মাইনিং",
            "এক্সেল",
            "Python",
            "ওয়েব স্ক্র্যাপিং"
        ],
        "budget": "$107\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Customized Monday.com Task Management System",
        "description": "Scope of Work\nProject Title:\nScalable  Platform for Full Control of Clients, Technicians & Operations\nClient: Idan Zabari Consulting\nPrepared by: [Your Name]\nDate: [Insert Date]\n________________________________________\n1. Project Objective\nTo design and implement a scalable, automated task and operations management system using  for a cybersecurity and IT consulting business. The system will centralize all client activity, technician workload, SLA monitoring, and executive reporting while providing secure, role-based access and full operational control.\nThe solution will support seamless growth to 20+ clients, with future-readiness for 50+, minimal manual overhead, and Microsoft 365 integration (Teams, Outlook, OneDrive) for optimized workflow and collaboration.\n_______________________...",
        "skills": [
            "ডেটা ইন্টিগ্রেশন",
            "Monday.com"
        ],
        "budget": "$750\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Niche Traffic Boost for My Website hmm",
        "description": "I'm looking to increase the number of visitors to my website, specifically targeting a niche audience. As of now, I've not implemented any digital marketing strategies.\n\n- **Primary Goal:** My main objective is to drive more visitors to my site.\n- **Target Audience:** The traffic needs to be focused on a specific niche, rather than general or local audiences.\n- **Current Marketing Efforts:** I haven't tried any strategies yet, so there's a lot of potential for growth.\n\nIdeal freelancer for this project should be well-versed in digital marketing, particularly in reaching specific niche audiences. Skills in SEO, Social Media Marketing, and understanding of effective Paid Advertising strategies are crucial. Prior experience in boosting traffic for niche websites will be hi...",
        "skills": [
            "ফেসবুক বিপণন",
            "ইন্টারনেট বিপণন",
            "লিঙ্ক বিল্ডিং",
            "বিপণন",
            "এসইও"
        ],
        "budget": "$245\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Residential Blueprints for New Construction",
        "description": "I'm seeking a professional who can create comprehensive blueprints for a new residential construction project. The blueprints need to encompass all necessary aspects of architectural and engineering designs, including mechanical, electrical, and civil engineering.\n\nKey Deliverables:\n- Detailed architectural blueprints\n- Comprehensive mechanical, electrical, and civil engineering designs\n- Drainage and Grading Plans\n- Elevations\n- All blueprints should meet the standards for obtaining residential permits (Phoenix, AZ)\n- Stamped Architectural Plans\n- QUICK delivery\n- CAD File for current plans available (they are not the best), but if we can have those edited and adjusted to be city approved that would be ideal due to short timeline\n- If you have previous plans approved from the city of...",
        "skills": [
            "ত্রিমাত্রিক রুপান্তরণ",
            "অটোসিএডি",
            "বিল্ডিং আর্কিটেকচার",
            "CAD/CAM",
            "ইন্টেরিয়র ডিজাইন"
        ],
        "budget": "$1811\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Need a logo designer for an app",
        "description": "I'm in search of a talented logo designer to create a fun and vibrant logo for my app. The logo should be energitic and attractive in style but convey a sense of the service of the app and energy\n\nKey requirements:\n- Design a bright and colorful app logo woth hues of orange\n- Incorporate a attractive, trending, eye attractive look\n- Minimalist style with a touch of creativity\n- I want it to be done illustration and want various outputs for graphic designing \n\nIdeal skills:\n- Proficiency in logo design, illustration\n- Ability to create a fun and playful logo\n- Experience with minimalist design\n- Knowledge of color theory and application in design",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "ইলাস্ট্রেশন",
            "ইলাস্ট্রেটর",
            "লোগো ডিজাইন",
            "ফটোশপ"
        ],
        "budget": "$15\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "No-Code Job Auto-Apply Web Platform Creation",
        "description": "Build a No-Code Job Automation Platform (Like LoopCV)\n\nI am looking to build a job automation web platform similar to , but using no-code tools like Bubble, Webflow, , Zapier, and Airtable.\n\nThe platform should allow users to:\n\nSign up/login securely\nUpload and parse resumes\nSet job preferences (roles, keywords, location, etc.)\nAutomatically fetch job listings from platforms like LinkedIn, Indeed, etc.\nAuto-apply or notify users based on matching jobs\nShow a dashboard with application status/history\nSend email notifications\nIntegrate a payment gateway (Stripe/Razorpay) for premium features\n\nI don’t have coding knowledge, so this project must be fully manageable by you for which i will give recurring payments every month for maintenance after the project is ready and fully functional....",
        "skills": [
            "Bubble Developer",
            "HTML",
            "JavaScript",
            "সফটওয়্যার আর্কিটেকচার",
            "ওয়েবসাইট ডিজাইন"
        ],
        "budget": "$14\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Non-Fiction Book Editor Needed",
        "description": "I'm seeking an experienced editor for my non-fiction book on artifical intelligence. Your primary focus will be on story structure and flow. \n\nIdeal skills and experience:\n- Proven experience in editing non-fiction books and artifical intelligence as must \n- Excellent understanding of story structure and flow in non-fiction\n- Strong communication skills for suggesting improvements",
        "skills": [
            "বই লিখন",
            "ই-বুক",
            "সম্পাদনা",
            "ঘোস্টরাইটিং",
            "ভুল সংশোধন করা"
        ],
        "budget": "$350\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "Private iOS App Distribution",
        "description": "I need assistance in distributing a mobile application developed by our company. This iOS app is intended solely for our employees and select customers, and the distribution needs to be secure and private. The app must be distributed through the Apple Developer Enterprise Program.\n\nIdeal skills and experience for the job:\n- Extensive knowledge of the Apple Developer Enterprise Program.\n- Experience in distributing iOS applications.\n- Understanding of secure and private app distribution.\n- Knowledge of mobile application development is a plus.",
        "skills": [
            "আইপ্যাড",
            "আইফোন",
            "মোবাইল অ্যাপ ডেভেলপমেন্ট",
            "অবজেক্টিভ সি",
            "সুইফট"
        ],
        "budget": "$2453\n                                                                    \n                                        Avg Bid"
    },
    {
        "title": "i need a logo adjusted",
        "description": "I want a designer to replicate the logo attached but instead of the initials \"SPE\" can we replace with \"RSC\". Can you please make two versions like the two attachments here - one with white back ground (blue logo / letters) and blue background (white logo / letters). the blue colour is 5, 5, 91.",
        "skills": [
            "গ্রাফিক ডিজাইন",
            "লোগো ডিজাইন"
        ],
        "budget": "$90"
    }
]